Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
extern volatile __SS3Rbits_t SS3Rbits __asm__ ("SS3R") __attribute__((section("sfrs"), address(0xBF8014B4)));
#define SCK4R SCK4R
extern volatile uint32_t   SCK4R __attribute__((section("sfrs"), address(0xBF8014B8)));
typedef struct {
  uint32_t SCK4R:4;
} __SCK4Rbits_t;
extern volatile __SCK4Rbits_t SCK4Rbits __asm__ ("SCK4R") __attribute__((section("sfrs"), address(0xBF8014B8)));
#define SDI4R SDI4R
extern volatile uint32_t   SDI4R __attribute__((section("sfrs"), address(0xBF8014BC)));
typedef struct {
  uint32_t SDI4R:4;
} __SDI4Rbits_t;
extern volatile __SDI4Rbits_t SDI4Rbits __asm__ ("SDI4R") __attribute__((section("sfrs"), address(0xBF8014BC)));
#define SS4R SS4R
extern volatile uint32_t   SS4R __attribute__((section("sfrs"), address(0xBF8014C0)));
typedef struct {
  uint32_t SS4R:4;
} __SS4Rbits_t;
extern volatile __SS4Rbits_t SS4Rbits __asm__ ("SS4R") __attribute__((section("sfrs"), address(0xBF8014C0)));
#define REFIR REFIR
extern volatile uint32_t   REFIR __attribute__((section("sfrs"), address(0xBF8014CC)));
typedef struct {
  uint32_t REFIR:4;
} __REFIRbits_t;
extern volatile __REFIRbits_t REFIRbits __asm__ ("REFIR") __attribute__((section("sfrs"), address(0xBF8014CC)));
#define QEA1R QEA1R
extern volatile uint32_t   QEA1R __attribute__((section("sfrs"), address(0xBF8014D0)));
typedef struct {
  uint32_t QEA1R:4;
} __QEA1Rbits_t;
extern volatile __QEA1Rbits_t QEA1Rbits __asm__ ("QEA1R") __attribute__((section("sfrs"), address(0xBF8014D0)));
#define QEB1R QEB1R
extern volatile uint32_t   QEB1R __attribute__((section("sfrs"), address(0xBF8014D4)));
typedef struct {
  uint32_t QEB1R:4;
} __QEB1Rbits_t;
extern volatile __QEB1Rbits_t QEB1Rbits __asm__ ("QEB1R") __attribute__((section("sfrs"), address(0xBF8014D4)));
#define INDX1R INDX1R
extern volatile uint32_t   INDX1R __attribute__((section("sfrs"), address(0xBF8014D8)));
typedef struct {
  uint32_t INDX1R:4;
} __INDX1Rbits_t;
extern volatile __INDX1Rbits_t INDX1Rbits __asm__ ("INDX1R") __attribute__((section("sfrs"), address(0xBF8014D8)));
#define HOME1R HOME1R
extern volatile uint32_t   HOME1R __attribute__((section("sfrs"), address(0xBF8014DC)));
typedef struct {
  uint32_t HOME1R:4;
} __HOME1Rbits_t;
extern volatile __HOME1Rbits_t HOME1Rbits __asm__ ("HOME1R") __attribute__((section("sfrs"), address(0xBF8014DC)));
#define QEA2R QEA2R
extern volatile uint32_t   QEA2R __attribute__((section("sfrs"), address(0xBF8014E0)));
typedef struct {
  uint32_t QEA2R:4;
} __QEA2Rbits_t;
extern volatile __QEA2Rbits_t QEA2Rbits __asm__ ("QEA2R") __attribute__((section("sfrs"), address(0xBF8014E0)));
#define QEB2R QEB2R
extern volatile uint32_t   QEB2R __attribute__((section("sfrs"), address(0xBF8014E4)));
typedef struct {
  uint32_t QEB2R:4;
} __QEB2Rbits_t;
extern volatile __QEB2Rbits_t QEB2Rbits __asm__ ("QEB2R") __attribute__((section("sfrs"), address(0xBF8014E4)));
#define INDX2R INDX2R
extern volatile uint32_t   INDX2R __attribute__((section("sfrs"), address(0xBF8014E8)));
typedef struct {
  uint32_t INDX2R:4;
} __INDX2Rbits_t;
extern volatile __INDX2Rbits_t INDX2Rbits __asm__ ("INDX2R") __attribute__((section("sfrs"), address(0xBF8014E8)));
#define HOME2R HOME2R
extern volatile uint32_t   HOME2R __attribute__((section("sfrs"), address(0xBF8014EC)));
typedef struct {
  uint32_t HOME2R:4;
} __HOME2Rbits_t;
extern volatile __HOME2Rbits_t HOME2Rbits __asm__ ("HOME2R") __attribute__((section("sfrs"), address(0xBF8014EC)));
#define FLT1R FLT1R
extern volatile uint32_t   FLT1R __attribute__((section("sfrs"), address(0xBF8014F0)));
typedef struct {
  uint32_t FLT1R:4;
} __FLT1Rbits_t;
extern volatile __FLT1Rbits_t FLT1Rbits __asm__ ("FLT1R") __attribute__((section("sfrs"), address(0xBF8014F0)));
#define FLT2R FLT2R
extern volatile uint32_t   FLT2R __attribute__((section("sfrs"), address(0xBF8014F4)));
typedef struct {
  uint32_t FLT2R:4;
} __FLT2Rbits_t;
extern volatile __FLT2Rbits_t FLT2Rbits __asm__ ("FLT2R") __attribute__((section("sfrs"), address(0xBF8014F4)));
#define CLCINAR CLCINAR
extern volatile uint32_t   CLCINAR __attribute__((section("sfrs"), address(0xBF801574)));
typedef struct {
  uint32_t CLCINAR:4;
} __CLCINARbits_t;
extern volatile __CLCINARbits_t CLCINARbits __asm__ ("CLCINAR") __attribute__((section("sfrs"), address(0xBF801574)));
#define CLCINBR CLCINBR
extern volatile uint32_t   CLCINBR __attribute__((section("sfrs"), address(0xBF801578)));
typedef struct {
  uint32_t CLCINBR:4;
} __CLCINBRbits_t;
extern volatile __CLCINBRbits_t CLCINBRbits __asm__ ("CLCINBR") __attribute__((section("sfrs"), address(0xBF801578)));
#define CLCINCR CLCINCR
extern volatile uint32_t   CLCINCR __attribute__((section("sfrs"), address(0xBF80157C)));
typedef struct {
  uint32_t CLCINCR:4;
} __CLCINCRbits_t;
extern volatile __CLCINCRbits_t CLCINCRbits __asm__ ("CLCINCR") __attribute__((section("sfrs"), address(0xBF80157C)));
#define CLCINDR CLCINDR
extern volatile uint32_t   CLCINDR __attribute__((section("sfrs"), address(0xBF801580)));
typedef struct {
  uint32_t CLCINDR:4;
} __CLCINDRbits_t;
extern volatile __CLCINDRbits_t CLCINDRbits __asm__ ("CLCINDR") __attribute__((section("sfrs"), address(0xBF801580)));
#define RPA0R RPA0R
extern volatile uint32_t   RPA0R __attribute__((section("sfrs"), address(0xBF801600)));
typedef struct {
  uint32_t RPA0R:5;
} __RPA0Rbits_t;
extern volatile __RPA0Rbits_t RPA0Rbits __asm__ ("RPA0R") __attribute__((section("sfrs"), address(0xBF801600)));
#define RPA1R RPA1R
extern volatile uint32_t   RPA1R __attribute__((section("sfrs"), address(0xBF801604)));
typedef struct {
  uint32_t RPA1R:5;
} __RPA1Rbits_t;
extern volatile __RPA1Rbits_t RPA1Rbits __asm__ ("RPA1R") __attribute__((section("sfrs"), address(0xBF801604)));
#define RPA2R RPA2R
extern volatile uint32_t   RPA2R __attribute__((section("sfrs"), address(0xBF801608)));
typedef struct {
  uint32_t RPA2R:5;
} __RPA2Rbits_t;
extern volatile __RPA2Rbits_t RPA2Rbits __asm__ ("RPA2R") __attribute__((section("sfrs"), address(0xBF801608)));
#define RPA3R RPA3R
extern volatile uint32_t   RPA3R __attribute__((section("sfrs"), address(0xBF80160C)));
typedef struct {
  uint32_t RPA3R:5;
} __RPA3Rbits_t;
