Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
extern volatile __STRIG4bits_t STRIG4bits __asm__ ("STRIG4") __attribute__((section("sfrs"), address(0xBF82A460)));
extern volatile uint32_t        STRIG4CLR __attribute__((section("sfrs"),address(0xBF82A464)));
extern volatile uint32_t        STRIG4SET __attribute__((section("sfrs"),address(0xBF82A468)));
extern volatile uint32_t        STRIG4INV __attribute__((section("sfrs"),address(0xBF82A46C)));
#define CAP4 CAP4
extern volatile uint32_t   CAP4 __attribute__((section("sfrs"), address(0xBF82A470)));
typedef struct {
  uint32_t CAP:16;
} __CAP4bits_t;
extern volatile __CAP4bits_t CAP4bits __asm__ ("CAP4") __attribute__((section("sfrs"), address(0xBF82A470)));
extern volatile uint32_t        CAP4CLR __attribute__((section("sfrs"),address(0xBF82A474)));
extern volatile uint32_t        CAP4SET __attribute__((section("sfrs"),address(0xBF82A478)));
extern volatile uint32_t        CAP4INV __attribute__((section("sfrs"),address(0xBF82A47C)));
#define LEBCON4 LEBCON4
extern volatile uint32_t   LEBCON4 __attribute__((section("sfrs"), address(0xBF82A480)));
typedef struct {
  uint32_t :10;
  uint32_t CLLEBEN:1;
  uint32_t FLTLEBEN:1;
  uint32_t PLF:1;
  uint32_t PLR:1;
  uint32_t PHF:1;
  uint32_t PHR:1;
} __LEBCON4bits_t;
extern volatile __LEBCON4bits_t LEBCON4bits __asm__ ("LEBCON4") __attribute__((section("sfrs"), address(0xBF82A480)));
extern volatile uint32_t        LEBCON4CLR __attribute__((section("sfrs"),address(0xBF82A484)));
extern volatile uint32_t        LEBCON4SET __attribute__((section("sfrs"),address(0xBF82A488)));
extern volatile uint32_t        LEBCON4INV __attribute__((section("sfrs"),address(0xBF82A48C)));
#define LEBDLY4 LEBDLY4
extern volatile uint32_t   LEBDLY4 __attribute__((section("sfrs"), address(0xBF82A490)));
typedef struct {
  uint32_t LEB:12;
} __LEBDLY4bits_t;
extern volatile __LEBDLY4bits_t LEBDLY4bits __asm__ ("LEBDLY4") __attribute__((section("sfrs"), address(0xBF82A490)));
extern volatile uint32_t        LEBDLY4CLR __attribute__((section("sfrs"),address(0xBF82A494)));
extern volatile uint32_t        LEBDLY4SET __attribute__((section("sfrs"),address(0xBF82A498)));
extern volatile uint32_t        LEBDLY4INV __attribute__((section("sfrs"),address(0xBF82A49C)));
#define AUXCON4 AUXCON4
extern volatile uint32_t   AUXCON4 __attribute__((section("sfrs"), address(0xBF82A4A0)));
typedef struct {
  uint32_t CHOPLEN:1;
  uint32_t CHOPHEN:1;
  uint32_t CHOPSEL:4;
} __AUXCON4bits_t;
extern volatile __AUXCON4bits_t AUXCON4bits __asm__ ("AUXCON4") __attribute__((section("sfrs"), address(0xBF82A4A0)));
extern volatile uint32_t        AUXCON4CLR __attribute__((section("sfrs"),address(0xBF82A4A4)));
extern volatile uint32_t        AUXCON4SET __attribute__((section("sfrs"),address(0xBF82A4A8)));
extern volatile uint32_t        AUXCON4INV __attribute__((section("sfrs"),address(0xBF82A4AC)));
#define PTMR4 PTMR4
extern volatile uint32_t   PTMR4 __attribute__((section("sfrs"), address(0xBF82A4B0)));
typedef struct {
  uint32_t TMR:16;
} __PTMR4bits_t;
extern volatile __PTMR4bits_t PTMR4bits __asm__ ("PTMR4") __attribute__((section("sfrs"), address(0xBF82A4B0)));
extern volatile uint32_t        PTMR4CLR __attribute__((section("sfrs"),address(0xBF82A4B4)));
extern volatile uint32_t        PTMR4SET __attribute__((section("sfrs"),address(0xBF82A4B8)));
extern volatile uint32_t        PTMR4INV __attribute__((section("sfrs"),address(0xBF82A4BC)));
#define QEI1CON QEI1CON
extern volatile uint32_t   QEI1CON __attribute__((section("sfrs"), address(0xBF82B200)));
typedef struct {
  uint32_t CCM:2;
  uint32_t GATEN:1;
  uint32_t CNTPOL:1;
  uint32_t INTDIV:3;
  uint32_t :1;
  uint32_t IMV:2;
  uint32_t PIMOD:3;
  uint32_t QEISIDL:1;
  uint32_t :1;
  uint32_t QEIEN:1;
} __QEI1CONbits_t;
extern volatile __QEI1CONbits_t QEI1CONbits __asm__ ("QEI1CON") __attribute__((section("sfrs"), address(0xBF82B200)));
extern volatile uint32_t        QEI1CONCLR __attribute__((section("sfrs"),address(0xBF82B204)));
extern volatile uint32_t        QEI1CONSET __attribute__((section("sfrs"),address(0xBF82B208)));
extern volatile uint32_t        QEI1CONINV __attribute__((section("sfrs"),address(0xBF82B20C)));
#define QEI1IOC QEI1IOC
extern volatile uint32_t   QEI1IOC __attribute__((section("sfrs"), address(0xBF82B210)));
typedef struct {
  uint32_t QEA:1;
  uint32_t QEB:1;
  uint32_t INDEX:1;
  uint32_t HOME:1;
  uint32_t QEAPOL:1;
  uint32_t QEBPOL:1;
  uint32_t IDXPOL:1;
  uint32_t HOMPOL:1;
  uint32_t SWPAB:1;
  uint32_t OUTFNC:2;
  uint32_t QFDIV:3;
  uint32_t FLTREN:1;
  uint32_t QCAPEN:1;
  uint32_t HCAPEN:1;
} __QEI1IOCbits_t;
extern volatile __QEI1IOCbits_t QEI1IOCbits __asm__ ("QEI1IOC") __attribute__((section("sfrs"), address(0xBF82B210)));
extern volatile uint32_t        QEI1IOCCLR __attribute__((section("sfrs"),address(0xBF82B214)));
extern volatile uint32_t        QEI1IOCSET __attribute__((section("sfrs"),address(0xBF82B218)));
extern volatile uint32_t        QEI1IOCINV __attribute__((section("sfrs"),address(0xBF82B21C)));
#define QEI1STAT QEI1STAT
extern volatile uint32_t   QEI1STAT __attribute__((section("sfrs"), address(0xBF82B220)));
typedef struct {
  uint32_t IDXIEN:1;
  uint32_t IDXIRQ:1;
  uint32_t HOMIEN:1;
  uint32_t HOMIRQ:1;
  uint32_t VELOVIEN:1;
  uint32_t VELOVIRQ:1;
  uint32_t PCIIEN:1;
  uint32_t PCIIRQ:1;
  uint32_t POSOVIEN:1;
  uint32_t POSOVIRQ:1;
  uint32_t PCLEQIEN:1;
  uint32_t PCLEQIRQ:1;
  uint32_t PCHEQIEN:1;
  uint32_t PCHEQIRQ:1;
} __QEI1STATbits_t;
extern volatile __QEI1STATbits_t QEI1STATbits __asm__ ("QEI1STAT") __attribute__((section("sfrs"), address(0xBF82B220)));
extern volatile uint32_t        QEI1STATCLR __attribute__((section("sfrs"),address(0xBF82B224)));
extern volatile uint32_t        QEI1STATSET __attribute__((section("sfrs"),address(0xBF82B228)));
extern volatile uint32_t        QEI1STATINV __attribute__((section("sfrs"),address(0xBF82B22C)));
#define POS1CNT POS1CNT
extern volatile uint32_t   POS1CNT __attribute__((section("sfrs"), address(0xBF82B230)));
typedef struct {
  uint32_t POSCNT:32;
} __POS1CNTbits_t;
