Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
extern volatile __POS2HLDbits_t POS2HLDbits __asm__ ("POS2HLD") __attribute__((section("sfrs"), address(0xBF82B440)));
extern volatile uint32_t        POS2HLDCLR __attribute__((section("sfrs"),address(0xBF82B444)));
extern volatile uint32_t        POS2HLDSET __attribute__((section("sfrs"),address(0xBF82B448)));
extern volatile uint32_t        POS2HLDINV __attribute__((section("sfrs"),address(0xBF82B44C)));
#define VEL2CNT VEL2CNT
extern volatile uint32_t   VEL2CNT __attribute__((section("sfrs"), address(0xBF82B450)));
typedef struct {
  uint32_t VELCNT:32;
} __VEL2CNTbits_t;
extern volatile __VEL2CNTbits_t VEL2CNTbits __asm__ ("VEL2CNT") __attribute__((section("sfrs"), address(0xBF82B450)));
extern volatile uint32_t        VEL2CNTCLR __attribute__((section("sfrs"),address(0xBF82B454)));
extern volatile uint32_t        VEL2CNTSET __attribute__((section("sfrs"),address(0xBF82B458)));
extern volatile uint32_t        VEL2CNTINV __attribute__((section("sfrs"),address(0xBF82B45C)));
#define VEL2HLD VEL2HLD
extern volatile uint32_t   VEL2HLD __attribute__((section("sfrs"), address(0xBF82B460)));
typedef struct {
  uint32_t VELHLD:32;
} __VEL2HLDbits_t;
extern volatile __VEL2HLDbits_t VEL2HLDbits __asm__ ("VEL2HLD") __attribute__((section("sfrs"), address(0xBF82B460)));
extern volatile uint32_t        VEL2HLDCLR __attribute__((section("sfrs"),address(0xBF82B464)));
extern volatile uint32_t        VEL2HLDSET __attribute__((section("sfrs"),address(0xBF82B468)));
extern volatile uint32_t        VEL2HLDINV __attribute__((section("sfrs"),address(0xBF82B46C)));
#define INT2TMR INT2TMR
extern volatile uint32_t   INT2TMR __attribute__((section("sfrs"), address(0xBF82B470)));
typedef struct {
  uint32_t INTTMR:32;
} __INT2TMRbits_t;
extern volatile __INT2TMRbits_t INT2TMRbits __asm__ ("INT2TMR") __attribute__((section("sfrs"), address(0xBF82B470)));
extern volatile uint32_t        INT2TMRCLR __attribute__((section("sfrs"),address(0xBF82B474)));
extern volatile uint32_t        INT2TMRSET __attribute__((section("sfrs"),address(0xBF82B478)));
extern volatile uint32_t        INT2TMRINV __attribute__((section("sfrs"),address(0xBF82B47C)));
#define INT2HLD INT2HLD
extern volatile uint32_t   INT2HLD __attribute__((section("sfrs"), address(0xBF82B480)));
typedef struct {
  uint32_t INTHLD:32;
} __INT2HLDbits_t;
extern volatile __INT2HLDbits_t INT2HLDbits __asm__ ("INT2HLD") __attribute__((section("sfrs"), address(0xBF82B480)));
extern volatile uint32_t        INT2HLDCLR __attribute__((section("sfrs"),address(0xBF82B484)));
extern volatile uint32_t        INT2HLDSET __attribute__((section("sfrs"),address(0xBF82B488)));
extern volatile uint32_t        INT2HLDINV __attribute__((section("sfrs"),address(0xBF82B48C)));
#define INDX2CNT INDX2CNT
extern volatile uint32_t   INDX2CNT __attribute__((section("sfrs"), address(0xBF82B490)));
typedef struct {
  uint32_t INDXCNT:32;
} __INDX2CNTbits_t;
extern volatile __INDX2CNTbits_t INDX2CNTbits __asm__ ("INDX2CNT") __attribute__((section("sfrs"), address(0xBF82B490)));
extern volatile uint32_t        INDX2CNTCLR __attribute__((section("sfrs"),address(0xBF82B494)));
extern volatile uint32_t        INDX2CNTSET __attribute__((section("sfrs"),address(0xBF82B498)));
extern volatile uint32_t        INDX2CNTINV __attribute__((section("sfrs"),address(0xBF82B49C)));
#define INDX2HLD INDX2HLD
extern volatile uint32_t   INDX2HLD __attribute__((section("sfrs"), address(0xBF82B4A0)));
typedef struct {
  uint32_t INDXHLD:32;
} __INDX2HLDbits_t;
extern volatile __INDX2HLDbits_t INDX2HLDbits __asm__ ("INDX2HLD") __attribute__((section("sfrs"), address(0xBF82B4A0)));
extern volatile uint32_t        INDX2HLDCLR __attribute__((section("sfrs"),address(0xBF82B4A4)));
extern volatile uint32_t        INDX2HLDSET __attribute__((section("sfrs"),address(0xBF82B4A8)));
extern volatile uint32_t        INDX2HLDINV __attribute__((section("sfrs"),address(0xBF82B4AC)));
#define QEI2ICC QEI2ICC
extern volatile uint32_t   QEI2ICC __attribute__((section("sfrs"), address(0xBF82B4B0)));
typedef struct {
  uint32_t QEIICC:32;
} __QEI2ICCbits_t;
extern volatile __QEI2ICCbits_t QEI2ICCbits __asm__ ("QEI2ICC") __attribute__((section("sfrs"), address(0xBF82B4B0)));
extern volatile uint32_t        QEI2ICCCLR __attribute__((section("sfrs"),address(0xBF82B4B4)));
extern volatile uint32_t        QEI2ICCSET __attribute__((section("sfrs"),address(0xBF82B4B8)));
extern volatile uint32_t        QEI2ICCINV __attribute__((section("sfrs"),address(0xBF82B4BC)));
#define QEI2CMPL QEI2CMPL
extern volatile uint32_t   QEI2CMPL __attribute__((section("sfrs"), address(0xBF82B4C0)));
typedef struct {
  uint32_t QEICMPL:32;
} __QEI2CMPLbits_t;
extern volatile __QEI2CMPLbits_t QEI2CMPLbits __asm__ ("QEI2CMPL") __attribute__((section("sfrs"), address(0xBF82B4C0)));
extern volatile uint32_t        QEI2CMPLCLR __attribute__((section("sfrs"),address(0xBF82B4C4)));
extern volatile uint32_t        QEI2CMPLSET __attribute__((section("sfrs"),address(0xBF82B4C8)));
extern volatile uint32_t        QEI2CMPLINV __attribute__((section("sfrs"),address(0xBF82B4CC)));
#define CMSTAT CMSTAT
extern volatile uint32_t   CMSTAT __attribute__((section("sfrs"), address(0xBF82C000)));
typedef struct {
  uint32_t C1OUT:1;
  uint32_t C2OUT:1;
  uint32_t C3OUT:1;
  uint32_t C4OUT:1;
  uint32_t C5OUT:1;
  uint32_t :8;
  uint32_t SIDL:1;
  uint32_t :2;
  uint32_t C1EVT:1;
  uint32_t C2EVT:1;
  uint32_t C3EVT:1;
  uint32_t C4EVT:1;
  uint32_t C5EVT:1;
} __CMSTATbits_t;
extern volatile __CMSTATbits_t CMSTATbits __asm__ ("CMSTAT") __attribute__((section("sfrs"), address(0xBF82C000)));
extern volatile uint32_t        CMSTATCLR __attribute__((section("sfrs"),address(0xBF82C004)));
extern volatile uint32_t        CMSTATSET __attribute__((section("sfrs"),address(0xBF82C008)));
extern volatile uint32_t        CMSTATINV __attribute__((section("sfrs"),address(0xBF82C00C)));
#define CM1CON CM1CON
extern volatile uint32_t   CM1CON __attribute__((section("sfrs"), address(0xBF82C010)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t :2;
  uint32_t OPLPWR:1;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
  uint32_t CFDIV:3;
  uint32_t CFLTREN:1;
  uint32_t CFSEL:3;
  uint32_t :1;
  uint32_t HYSSEL:2;
  uint32_t :2;
  uint32_t HYSPOL:1;
  uint32_t :1;
  uint32_t ENPGA:1;
  uint32_t OPAON:1;
} __CM1CONbits_t;
