Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
extern volatile __ADCCMP2bits_t ADCCMP2bits __asm__ ("ADCCMP2") __attribute__((section("sfrs"), address(0xBF887110)));
extern volatile uint32_t        ADCCMP2CLR __attribute__((section("sfrs"),address(0xBF887114)));
extern volatile uint32_t        ADCCMP2SET __attribute__((section("sfrs"),address(0xBF887118)));
extern volatile uint32_t        ADCCMP2INV __attribute__((section("sfrs"),address(0xBF88711C)));
#define ADCFLTR1 ADCFLTR1
extern volatile uint32_t   ADCFLTR1 __attribute__((section("sfrs"), address(0xBF8871A0)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:5;
  uint32_t :3;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t DFMODE:1;
  uint32_t DATA16EN:1;
  uint32_t AFEN:1;
} __ADCFLTR1bits_t;
extern volatile __ADCFLTR1bits_t ADCFLTR1bits __asm__ ("ADCFLTR1") __attribute__((section("sfrs"), address(0xBF8871A0)));
extern volatile uint32_t        ADCFLTR1CLR __attribute__((section("sfrs"),address(0xBF8871A4)));
extern volatile uint32_t        ADCFLTR1SET __attribute__((section("sfrs"),address(0xBF8871A8)));
extern volatile uint32_t        ADCFLTR1INV __attribute__((section("sfrs"),address(0xBF8871AC)));
#define ADCFLTR2 ADCFLTR2
extern volatile uint32_t   ADCFLTR2 __attribute__((section("sfrs"), address(0xBF8871B0)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:5;
  uint32_t :3;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t DFMODE:1;
  uint32_t DATA16EN:1;
  uint32_t AFEN:1;
} __ADCFLTR2bits_t;
extern volatile __ADCFLTR2bits_t ADCFLTR2bits __asm__ ("ADCFLTR2") __attribute__((section("sfrs"), address(0xBF8871B0)));
extern volatile uint32_t        ADCFLTR2CLR __attribute__((section("sfrs"),address(0xBF8871B4)));
extern volatile uint32_t        ADCFLTR2SET __attribute__((section("sfrs"),address(0xBF8871B8)));
extern volatile uint32_t        ADCFLTR2INV __attribute__((section("sfrs"),address(0xBF8871BC)));
#define ADCTRG1 ADCTRG1
extern volatile uint32_t   ADCTRG1 __attribute__((section("sfrs"), address(0xBF887200)));
typedef struct {
  uint32_t TRGSRC0:5;
  uint32_t :3;
  uint32_t TRGSRC1:5;
  uint32_t :3;
  uint32_t TRGSRC2:5;
  uint32_t :3;
  uint32_t TRGSRC3:5;
} __ADCTRG1bits_t;
extern volatile __ADCTRG1bits_t ADCTRG1bits __asm__ ("ADCTRG1") __attribute__((section("sfrs"), address(0xBF887200)));
extern volatile uint32_t        ADCTRG1CLR __attribute__((section("sfrs"),address(0xBF887204)));
extern volatile uint32_t        ADCTRG1SET __attribute__((section("sfrs"),address(0xBF887208)));
extern volatile uint32_t        ADCTRG1INV __attribute__((section("sfrs"),address(0xBF88720C)));
#define ADCTRG2 ADCTRG2
extern volatile uint32_t   ADCTRG2 __attribute__((section("sfrs"), address(0xBF887210)));
typedef struct {
  uint32_t TRGSRC4:5;
  uint32_t :3;
  uint32_t TRGSRC5:5;
} __ADCTRG2bits_t;
extern volatile __ADCTRG2bits_t ADCTRG2bits __asm__ ("ADCTRG2") __attribute__((section("sfrs"), address(0xBF887210)));
extern volatile uint32_t        ADCTRG2CLR __attribute__((section("sfrs"),address(0xBF887214)));
extern volatile uint32_t        ADCTRG2SET __attribute__((section("sfrs"),address(0xBF887218)));
extern volatile uint32_t        ADCTRG2INV __attribute__((section("sfrs"),address(0xBF88721C)));
#define ADCTRG3 ADCTRG3
extern volatile uint32_t   ADCTRG3 __attribute__((section("sfrs"), address(0xBF887220)));
typedef struct {
  uint32_t :8;
  uint32_t TRGSRC9:5;
} __ADCTRG3bits_t;
extern volatile __ADCTRG3bits_t ADCTRG3bits __asm__ ("ADCTRG3") __attribute__((section("sfrs"), address(0xBF887220)));
extern volatile uint32_t        ADCTRG3CLR __attribute__((section("sfrs"),address(0xBF887224)));
extern volatile uint32_t        ADCTRG3SET __attribute__((section("sfrs"),address(0xBF887228)));
extern volatile uint32_t        ADCTRG3INV __attribute__((section("sfrs"),address(0xBF88722C)));
#define ADCTRG4 ADCTRG4
extern volatile uint32_t   ADCTRG4 __attribute__((section("sfrs"), address(0xBF887230)));
typedef struct {
  uint32_t TRGSRC12:5;
  uint32_t :3;
  uint32_t TRGSRC13:5;
  uint32_t :11;
  uint32_t TRGSRC15:5;
} __ADCTRG4bits_t;
extern volatile __ADCTRG4bits_t ADCTRG4bits __asm__ ("ADCTRG4") __attribute__((section("sfrs"), address(0xBF887230)));
extern volatile uint32_t        ADCTRG4CLR __attribute__((section("sfrs"),address(0xBF887234)));
extern volatile uint32_t        ADCTRG4SET __attribute__((section("sfrs"),address(0xBF887238)));
extern volatile uint32_t        ADCTRG4INV __attribute__((section("sfrs"),address(0xBF88723C)));
#define ADCTRG5 ADCTRG5
extern volatile uint32_t   ADCTRG5 __attribute__((section("sfrs"), address(0xBF887240)));
typedef struct {
  uint32_t TRGSRC16:5;
  uint32_t :3;
  uint32_t TRGSRC17:5;
} __ADCTRG5bits_t;
extern volatile __ADCTRG5bits_t ADCTRG5bits __asm__ ("ADCTRG5") __attribute__((section("sfrs"), address(0xBF887240)));
extern volatile uint32_t        ADCTRG5CLR __attribute__((section("sfrs"),address(0xBF887244)));
extern volatile uint32_t        ADCTRG5SET __attribute__((section("sfrs"),address(0xBF887248)));
extern volatile uint32_t        ADCTRG5INV __attribute__((section("sfrs"),address(0xBF88724C)));
#define ADCCMPCON1 ADCCMPCON1
extern volatile uint32_t   ADCCMPCON1 __attribute__((section("sfrs"), address(0xBF887280)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:6;
} __ADCCMPCON1bits_t;
extern volatile __ADCCMPCON1bits_t ADCCMPCON1bits __asm__ ("ADCCMPCON1") __attribute__((section("sfrs"), address(0xBF887280)));
extern volatile uint32_t        ADCCMPCON1CLR __attribute__((section("sfrs"),address(0xBF887284)));
extern volatile uint32_t        ADCCMPCON1SET __attribute__((section("sfrs"),address(0xBF887288)));
extern volatile uint32_t        ADCCMPCON1INV __attribute__((section("sfrs"),address(0xBF88728C)));
#define ADCCMPCON2 ADCCMPCON2
extern volatile uint32_t   ADCCMPCON2 __attribute__((section("sfrs"), address(0xBF887290)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __ADCCMPCON2bits_t;
extern volatile __ADCCMPCON2bits_t ADCCMPCON2bits __asm__ ("ADCCMPCON2") __attribute__((section("sfrs"), address(0xBF887290)));
extern volatile uint32_t        ADCCMPCON2CLR __attribute__((section("sfrs"),address(0xBF887294)));
extern volatile uint32_t        ADCCMPCON2SET __attribute__((section("sfrs"),address(0xBF887298)));
extern volatile uint32_t        ADCCMPCON2INV __attribute__((section("sfrs"),address(0xBF88729C)));
#define ADCBASE ADCBASE
extern volatile uint32_t   ADCBASE __attribute__((section("sfrs"), address(0xBF887300)));
typedef struct {
  uint32_t ADCBASE:16;
} __ADCBASEbits_t;
extern volatile __ADCBASEbits_t ADCBASEbits __asm__ ("ADCBASE") __attribute__((section("sfrs"), address(0xBF887300)));
extern volatile uint32_t        ADCBASECLR __attribute__((section("sfrs"),address(0xBF887304)));
extern volatile uint32_t        ADCBASESET __attribute__((section("sfrs"),address(0xBF887308)));
extern volatile uint32_t        ADCBASEINV __attribute__((section("sfrs"),address(0xBF88730C)));
#define ADCDSTAT ADCDSTAT
extern volatile uint32_t   ADCDSTAT __attribute__((section("sfrs"), address(0xBF887310)));
typedef struct {
  uint32_t RAF0:1;
  uint32_t RAF1:1;
  uint32_t :6;
  uint32_t RAFIEN0:1;
  uint32_t RAFIEN1:1;
  uint32_t :5;
  uint32_t DMACEN:1;
  uint32_t RBF0:1;
  uint32_t RBF1:1;
  uint32_t :5;
  uint32_t WOVERR:1;
  uint32_t RBFIEN0:1;
  uint32_t RBFIEN1:1;
  uint32_t :5;
  uint32_t DMAEN:1;
} __ADCDSTATbits_t;
