Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
extern volatile __ADCDSTATbits_t ADCDSTATbits __asm__ ("ADCDSTAT") __attribute__((section("sfrs"), address(0xBF887310)));
extern volatile uint32_t        ADCDSTATCLR __attribute__((section("sfrs"),address(0xBF887314)));
extern volatile uint32_t        ADCDSTATSET __attribute__((section("sfrs"),address(0xBF887318)));
extern volatile uint32_t        ADCDSTATINV __attribute__((section("sfrs"),address(0xBF88731C)));
#define ADCCNTB ADCCNTB
extern volatile uint32_t   ADCCNTB __attribute__((section("sfrs"), address(0xBF887320)));
typedef struct {
  uint32_t ADCCNTB:32;
} __ADCCNTBbits_t;
extern volatile __ADCCNTBbits_t ADCCNTBbits __asm__ ("ADCCNTB") __attribute__((section("sfrs"), address(0xBF887320)));
extern volatile uint32_t        ADCCNTBCLR __attribute__((section("sfrs"),address(0xBF887324)));
extern volatile uint32_t        ADCCNTBSET __attribute__((section("sfrs"),address(0xBF887328)));
extern volatile uint32_t        ADCCNTBINV __attribute__((section("sfrs"),address(0xBF88732C)));
#define ADCDMAB ADCDMAB
extern volatile uint32_t   ADCDMAB __attribute__((section("sfrs"), address(0xBF887330)));
typedef struct {
  uint32_t ADCDMAB:32;
} __ADCDMABbits_t;
extern volatile __ADCDMABbits_t ADCDMABbits __asm__ ("ADCDMAB") __attribute__((section("sfrs"), address(0xBF887330)));
extern volatile uint32_t        ADCDMABCLR __attribute__((section("sfrs"),address(0xBF887334)));
extern volatile uint32_t        ADCDMABSET __attribute__((section("sfrs"),address(0xBF887338)));
extern volatile uint32_t        ADCDMABINV __attribute__((section("sfrs"),address(0xBF88733C)));
#define ADCTRGSNS ADCTRGSNS
extern volatile uint32_t   ADCTRGSNS __attribute__((section("sfrs"), address(0xBF887340)));
typedef struct {
  uint32_t LVL0:1;
  uint32_t LVL1:1;
  uint32_t LVL2:1;
  uint32_t LVL3:1;
  uint32_t LVL4:1;
  uint32_t LVL5:1;
  uint32_t :3;
  uint32_t LVL9:1;
  uint32_t :2;
  uint32_t LVL12:1;
  uint32_t LVL13:1;
  uint32_t :1;
  uint32_t LVL15:1;
  uint32_t LVL16:1;
  uint32_t LVL17:1;
} __ADCTRGSNSbits_t;
extern volatile __ADCTRGSNSbits_t ADCTRGSNSbits __asm__ ("ADCTRGSNS") __attribute__((section("sfrs"), address(0xBF887340)));
extern volatile uint32_t        ADCTRGSNSCLR __attribute__((section("sfrs"),address(0xBF887344)));
extern volatile uint32_t        ADCTRGSNSSET __attribute__((section("sfrs"),address(0xBF887348)));
extern volatile uint32_t        ADCTRGSNSINV __attribute__((section("sfrs"),address(0xBF88734C)));
#define ADC0TIME ADC0TIME
extern volatile uint32_t   ADC0TIME __attribute__((section("sfrs"), address(0xBF887350)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t BCHEN:1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC0TIMEbits_t;
extern volatile __ADC0TIMEbits_t ADC0TIMEbits __asm__ ("ADC0TIME") __attribute__((section("sfrs"), address(0xBF887350)));
extern volatile uint32_t        ADC0TIMECLR __attribute__((section("sfrs"),address(0xBF887354)));
extern volatile uint32_t        ADC0TIMESET __attribute__((section("sfrs"),address(0xBF887358)));
extern volatile uint32_t        ADC0TIMEINV __attribute__((section("sfrs"),address(0xBF88735C)));
#define ADC1TIME ADC1TIME
extern volatile uint32_t   ADC1TIME __attribute__((section("sfrs"), address(0xBF887360)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t BCHEN:1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC1TIMEbits_t;
extern volatile __ADC1TIMEbits_t ADC1TIMEbits __asm__ ("ADC1TIME") __attribute__((section("sfrs"), address(0xBF887360)));
extern volatile uint32_t        ADC1TIMECLR __attribute__((section("sfrs"),address(0xBF887364)));
extern volatile uint32_t        ADC1TIMESET __attribute__((section("sfrs"),address(0xBF887368)));
extern volatile uint32_t        ADC1TIMEINV __attribute__((section("sfrs"),address(0xBF88736C)));
#define ADCEIEN1 ADCEIEN1
extern volatile uint32_t   ADCEIEN1 __attribute__((section("sfrs"), address(0xBF8873C0)));
typedef struct {
  uint32_t EIEN0:1;
  uint32_t EIEN1:1;
  uint32_t EIEN2:1;
  uint32_t EIEN3:1;
  uint32_t EIEN4:1;
  uint32_t EIEN5:1;
  uint32_t :3;
  uint32_t EIEN9:1;
  uint32_t :2;
  uint32_t EIEN12:1;
  uint32_t EIEN13:1;
  uint32_t :1;
  uint32_t EIEN15:1;
  uint32_t EIEN16:1;
  uint32_t EIEN17:1;
} __ADCEIEN1bits_t;
extern volatile __ADCEIEN1bits_t ADCEIEN1bits __asm__ ("ADCEIEN1") __attribute__((section("sfrs"), address(0xBF8873C0)));
extern volatile uint32_t        ADCEIEN1CLR __attribute__((section("sfrs"),address(0xBF8873C4)));
extern volatile uint32_t        ADCEIEN1SET __attribute__((section("sfrs"),address(0xBF8873C8)));
extern volatile uint32_t        ADCEIEN1INV __attribute__((section("sfrs"),address(0xBF8873CC)));
#define ADCEIEN2 ADCEIEN2
extern volatile uint32_t   ADCEIEN2 __attribute__((section("sfrs"), address(0xBF8873D0)));
typedef struct {
  uint32_t :18;
  uint32_t EIEN50:1;
  uint32_t :2;
  uint32_t EIEN53:1;
} __ADCEIEN2bits_t;
extern volatile __ADCEIEN2bits_t ADCEIEN2bits __asm__ ("ADCEIEN2") __attribute__((section("sfrs"), address(0xBF8873D0)));
extern volatile uint32_t        ADCEIEN2CLR __attribute__((section("sfrs"),address(0xBF8873D4)));
extern volatile uint32_t        ADCEIEN2SET __attribute__((section("sfrs"),address(0xBF8873D8)));
extern volatile uint32_t        ADCEIEN2INV __attribute__((section("sfrs"),address(0xBF8873DC)));
#define ADCEISTAT1 ADCEISTAT1
extern volatile uint32_t   ADCEISTAT1 __attribute__((section("sfrs"), address(0xBF8873E0)));
typedef struct {
  uint32_t EIRDY0:1;
  uint32_t EIRDY1:1;
  uint32_t EIRDY2:1;
  uint32_t EIRDY3:1;
  uint32_t EIRDY4:1;
  uint32_t EIRDY5:1;
  uint32_t :3;
  uint32_t EIRDY9:1;
  uint32_t :2;
  uint32_t EIRDY12:1;
  uint32_t EIRDY13:1;
  uint32_t :1;
  uint32_t EIRDY15:1;
  uint32_t EIRDY16:1;
  uint32_t EIRDY17:1;
} __ADCEISTAT1bits_t;
extern volatile __ADCEISTAT1bits_t ADCEISTAT1bits __asm__ ("ADCEISTAT1") __attribute__((section("sfrs"), address(0xBF8873E0)));
extern volatile uint32_t        ADCEISTAT1CLR __attribute__((section("sfrs"),address(0xBF8873E4)));
extern volatile uint32_t        ADCEISTAT1SET __attribute__((section("sfrs"),address(0xBF8873E8)));
extern volatile uint32_t        ADCEISTAT1INV __attribute__((section("sfrs"),address(0xBF8873EC)));
#define ADCEISTAT2 ADCEISTAT2
extern volatile uint32_t   ADCEISTAT2 __attribute__((section("sfrs"), address(0xBF8873F0)));
typedef struct {
  uint32_t :18;
  uint32_t EIRDY50:1;
  uint32_t :2;
  uint32_t EIRDY53:1;
} __ADCEISTAT2bits_t;
extern volatile __ADCEISTAT2bits_t ADCEISTAT2bits __asm__ ("ADCEISTAT2") __attribute__((section("sfrs"), address(0xBF8873F0)));
extern volatile uint32_t        ADCEISTAT2CLR __attribute__((section("sfrs"),address(0xBF8873F4)));
extern volatile uint32_t        ADCEISTAT2SET __attribute__((section("sfrs"),address(0xBF8873F8)));
extern volatile uint32_t        ADCEISTAT2INV __attribute__((section("sfrs"),address(0xBF8873FC)));
#define ADCANCON ADCANCON
extern volatile uint32_t   ADCANCON __attribute__((section("sfrs"), address(0xBF887400)));
typedef struct {
  uint32_t ANEN0:1;
  uint32_t ANEN1:1;
  uint32_t :5;
  uint32_t ANEN7:1;
  uint32_t WKRDY0:1;
  uint32_t WKRDY1:1;
  uint32_t :5;
  uint32_t WKRDY7:1;
  uint32_t WKIEN0:1;
  uint32_t WKIEN1:1;
  uint32_t :5;
  uint32_t WKIEN7:1;
  uint32_t WKUPCLKCNT:4;
} __ADCANCONbits_t;
