Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
extern volatile __ADC0CFGbits_t ADC0CFGbits __asm__ ("ADC0CFG") __attribute__((section("sfrs"), address(0xBF887D00)));
extern volatile uint32_t        ADC0CFGCLR __attribute__((section("sfrs"),address(0xBF887D04)));
extern volatile uint32_t        ADC0CFGSET __attribute__((section("sfrs"),address(0xBF887D08)));
extern volatile uint32_t        ADC0CFGINV __attribute__((section("sfrs"),address(0xBF887D0C)));
#define ADC1CFG ADC1CFG
extern volatile uint32_t   ADC1CFG __attribute__((section("sfrs"), address(0xBF887D10)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC1CFGbits_t;
extern volatile __ADC1CFGbits_t ADC1CFGbits __asm__ ("ADC1CFG") __attribute__((section("sfrs"), address(0xBF887D10)));
extern volatile uint32_t        ADC1CFGCLR __attribute__((section("sfrs"),address(0xBF887D14)));
extern volatile uint32_t        ADC1CFGSET __attribute__((section("sfrs"),address(0xBF887D18)));
extern volatile uint32_t        ADC1CFGINV __attribute__((section("sfrs"),address(0xBF887D1C)));
#define ADC7CFG ADC7CFG
extern volatile uint32_t   ADC7CFG __attribute__((section("sfrs"), address(0xBF887D70)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC7CFGbits_t;
extern volatile __ADC7CFGbits_t ADC7CFGbits __asm__ ("ADC7CFG") __attribute__((section("sfrs"), address(0xBF887D70)));
extern volatile uint32_t        ADC7CFGCLR __attribute__((section("sfrs"),address(0xBF887D74)));
extern volatile uint32_t        ADC7CFGSET __attribute__((section("sfrs"),address(0xBF887D78)));
extern volatile uint32_t        ADC7CFGINV __attribute__((section("sfrs"),address(0xBF887D7C)));
#define ADCSYSCFG0 ADCSYSCFG0
extern volatile uint32_t   ADCSYSCFG0 __attribute__((section("sfrs"), address(0xBF887E00)));
typedef struct {
  uint32_t AN0:1;
  uint32_t AN1:1;
  uint32_t AN2:1;
  uint32_t AN3:1;
  uint32_t AN4:1;
  uint32_t AN5:1;
  uint32_t :3;
  uint32_t AN9:1;
  uint32_t :2;
  uint32_t AN12:1;
  uint32_t AN13:1;
  uint32_t :1;
  uint32_t AN15:1;
  uint32_t AN16:1;
  uint32_t AN17:1;
} __ADCSYSCFG0bits_t;
extern volatile __ADCSYSCFG0bits_t ADCSYSCFG0bits __asm__ ("ADCSYSCFG0") __attribute__((section("sfrs"), address(0xBF887E00)));
extern volatile uint32_t        ADCSYSCFG0CLR __attribute__((section("sfrs"),address(0xBF887E04)));
extern volatile uint32_t        ADCSYSCFG0SET __attribute__((section("sfrs"),address(0xBF887E08)));
extern volatile uint32_t        ADCSYSCFG0INV __attribute__((section("sfrs"),address(0xBF887E0C)));
#define ADCSYSCFG1 ADCSYSCFG1
extern volatile uint32_t   ADCSYSCFG1 __attribute__((section("sfrs"), address(0xBF887E10)));
typedef struct {
  uint32_t :18;
  uint32_t AN50:1;
  uint32_t :2;
  uint32_t AN53:1;
} __ADCSYSCFG1bits_t;
extern volatile __ADCSYSCFG1bits_t ADCSYSCFG1bits __asm__ ("ADCSYSCFG1") __attribute__((section("sfrs"), address(0xBF887E10)));
extern volatile uint32_t        ADCSYSCFG1CLR __attribute__((section("sfrs"),address(0xBF887E14)));
extern volatile uint32_t        ADCSYSCFG1SET __attribute__((section("sfrs"),address(0xBF887E18)));
extern volatile uint32_t        ADCSYSCFG1INV __attribute__((section("sfrs"),address(0xBF887E1C)));
#define RTCCON RTCCON
extern volatile uint32_t   RTCCON __attribute__((section("sfrs"), address(0xBF8C0000)));
typedef union {
  struct {
    uint32_t RTCOE:1;
    uint32_t HALFSEC:1;
    uint32_t RTCSYNC:1;
    uint32_t RTCWREN:1;
    uint32_t :2;
    uint32_t RTCCLKON:1;
    uint32_t RTCOUTSEL:2;
    uint32_t RTCCLKSEL:2;
    uint32_t :2;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t CAL:10;
  };
  struct {
    uint32_t w:32;
  };
} __RTCCONbits_t;
extern volatile __RTCCONbits_t RTCCONbits __asm__ ("RTCCON") __attribute__((section("sfrs"), address(0xBF8C0000)));
extern volatile uint32_t        RTCCONSET __attribute__((section("sfrs"),address(0xBF8C0008)));
extern volatile uint32_t        RTCCONINV __attribute__((section("sfrs"),address(0xBF8C000C)));
#define RTCALRM RTCALRM
extern volatile uint32_t   RTCALRM __attribute__((section("sfrs"), address(0xBF8C0010)));
typedef union {
  struct {
    uint32_t ARPT:8;
    uint32_t AMASK:4;
    uint32_t ALRMSYNC:1;
    uint32_t PIV:1;
    uint32_t CHIME:1;
    uint32_t ALRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __RTCALRMbits_t;
extern volatile __RTCALRMbits_t RTCALRMbits __asm__ ("RTCALRM") __attribute__((section("sfrs"), address(0xBF8C0010)));
extern volatile uint32_t        RTCALRMCLR __attribute__((section("sfrs"),address(0xBF8C0014)));
extern volatile uint32_t        RTCALRMSET __attribute__((section("sfrs"),address(0xBF8C0018)));
extern volatile uint32_t        RTCALRMINV __attribute__((section("sfrs"),address(0xBF8C001C)));
#define RTCTIME RTCTIME
extern volatile uint32_t   RTCTIME __attribute__((section("sfrs"), address(0xBF8C0020)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SEC01:4;
    uint32_t SEC10:4;
    uint32_t MIN01:4;
    uint32_t MIN10:4;
    uint32_t HR01:4;
    uint32_t HR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __RTCTIMEbits_t;
extern volatile __RTCTIMEbits_t RTCTIMEbits __asm__ ("RTCTIME") __attribute__((section("sfrs"), address(0xBF8C0020)));
extern volatile uint32_t        RTCTIMECLR __attribute__((section("sfrs"),address(0xBF8C0024)));
extern volatile uint32_t        RTCTIMESET __attribute__((section("sfrs"),address(0xBF8C0028)));
extern volatile uint32_t        RTCTIMEINV __attribute__((section("sfrs"),address(0xBF8C002C)));
#define RTCDATE RTCDATE
extern volatile uint32_t   RTCDATE __attribute__((section("sfrs"), address(0xBF8C0030)));
typedef union {
  struct {
    uint32_t WDAY01:4;
    uint32_t :4;
    uint32_t DAY01:4;
    uint32_t DAY10:4;
    uint32_t MONTH01:4;
    uint32_t MONTH10:4;
    uint32_t YEAR01:4;
    uint32_t YEAR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __RTCDATEbits_t;
extern volatile __RTCDATEbits_t RTCDATEbits __asm__ ("RTCDATE") __attribute__((section("sfrs"), address(0xBF8C0030)));
extern volatile uint32_t        RTCDATECLR __attribute__((section("sfrs"),address(0xBF8C0034)));
extern volatile uint32_t        RTCDATESET __attribute__((section("sfrs"),address(0xBF8C0038)));
extern volatile uint32_t        RTCDATEINV __attribute__((section("sfrs"),address(0xBF8C003C)));
#define ALRMTIME ALRMTIME
extern volatile uint32_t   ALRMTIME __attribute__((section("sfrs"), address(0xBF8C0040)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SEC01:4;
    uint32_t SEC10:4;
    uint32_t MIN01:4;
    uint32_t MIN10:4;
    uint32_t HR01:4;
    uint32_t HR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __ALRMTIMEbits_t;
extern volatile __ALRMTIMEbits_t ALRMTIMEbits __asm__ ("ALRMTIME") __attribute__((section("sfrs"), address(0xBF8C0040)));
extern volatile uint32_t        ALRMTIMECLR __attribute__((section("sfrs"),address(0xBF8C0044)));
extern volatile uint32_t        ALRMTIMESET __attribute__((section("sfrs"),address(0xBF8C0048)));
extern volatile uint32_t        ALRMTIMEINV __attribute__((section("sfrs"),address(0xBF8C004C)));
#define ALRMDATE ALRMDATE
extern volatile uint32_t   ALRMDATE __attribute__((section("sfrs"), address(0xBF8C0050)));
typedef union {
  struct {
    uint32_t WDAY01:4;
    uint32_t :4;
    uint32_t DAY01:4;
    uint32_t DAY10:4;
    uint32_t MONTH01:4;
    uint32_t MONTH10:4;
  };
  struct {
    uint32_t w:32;
  };
} __ALRMDATEbits_t;
