Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
extern volatile __BF1DEVCFG1bits_t BF1DEVCFG1bits __asm__ ("BF1DEVCFG1") __attribute__((section("sfrs"), address(0xBFC43FC8)));
#define BF1DEVCFG0 BF1DEVCFG0
extern volatile uint32_t   BF1DEVCFG0 __attribute__((section("sfrs"), address(0xBFC43FCC)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCAGCDLY:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCFG0bits_t;
extern volatile __BF1DEVCFG0bits_t BF1DEVCFG0bits __asm__ ("BF1DEVCFG0") __attribute__((section("sfrs"), address(0xBFC43FCC)));
#define BF1DEVCP BF1DEVCP
extern volatile uint32_t   BF1DEVCP __attribute__((section("sfrs"), address(0xBFC43FDC)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCPbits_t;
extern volatile __BF1DEVCPbits_t BF1DEVCPbits __asm__ ("BF1DEVCP") __attribute__((section("sfrs"), address(0xBFC43FDC)));
#define BF1DEVSIGN BF1DEVSIGN
extern volatile uint32_t   BF1DEVSIGN __attribute__((section("sfrs"), address(0xBFC43FEC)));
#define BF1SEQ BF1SEQ
extern volatile uint32_t   BF1SEQ __attribute__((section("sfrs"), address(0xBFC43FF0)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __BF1SEQbits_t;
extern volatile __BF1SEQbits_t BF1SEQbits __asm__ ("BF1SEQ") __attribute__((section("sfrs"), address(0xBFC43FF0)));
#ifdef __cplusplus
}
#endif

#elif defined (__LANGUAGE_ASSEMBLY__)
  .extern CFGCON           /* 0xBF800000 */
  .extern RESERVED         /* 0xBF800010 */
  .extern DEVID            /* 0xBF800020 */
  .extern SYSKEY           /* 0xBF800030 */
  .extern PMD1             /* 0xBF800040 */
  .extern PMD1CLR          /* 0xBF800044 */
  .extern PMD1SET          /* 0xBF800048 */
  .extern PMD1INV          /* 0xBF80004C */
  .extern PMD2             /* 0xBF800050 */
  .extern PMD2CLR          /* 0xBF800054 */
  .extern PMD2SET          /* 0xBF800058 */
  .extern PMD2INV          /* 0xBF80005C */
  .extern PMD3             /* 0xBF800060 */
  .extern PMD3CLR          /* 0xBF800064 */
  .extern PMD3SET          /* 0xBF800068 */
  .extern PMD3INV          /* 0xBF80006C */
  .extern PMD4             /* 0xBF800070 */
  .extern PMD4CLR          /* 0xBF800074 */
  .extern PMD4SET          /* 0xBF800078 */
  .extern PMD4INV          /* 0xBF80007C */
  .extern PMD5             /* 0xBF800080 */
  .extern PMD5CLR          /* 0xBF800084 */
  .extern PMD5SET          /* 0xBF800088 */
  .extern PMD5INV          /* 0xBF80008C */
  .extern PMD6             /* 0xBF800090 */
  .extern PMD6CLR          /* 0xBF800094 */
  .extern PMD6SET          /* 0xBF800098 */
  .extern PMD6INV          /* 0xBF80009C */
  .extern PMD7             /* 0xBF8000A0 */
  .extern PMD7CLR          /* 0xBF8000A4 */
  .extern PMD7SET          /* 0xBF8000A8 */
  .extern PMD7INV          /* 0xBF8000AC */
  .extern CFGPG            /* 0xBF8000E0 */
  .extern CFGPGCLR         /* 0xBF8000E4 */
  .extern CFGPGSET         /* 0xBF8000E8 */
  .extern CFGPGINV         /* 0xBF8000EC */
  .extern CHECON           /* 0xBF800800 */
  .extern CHECONCLR        /* 0xBF800804 */
  .extern CHECONSET        /* 0xBF800808 */
  .extern CHECONINV        /* 0xBF80080C */
  .extern CHESTAT          /* 0xBF800810 */
  .extern CHEHIT           /* 0xBF800820 */
  .extern CHEMIS           /* 0xBF800830 */
  .extern NVMCON           /* 0xBF800A00 */
  .extern NVMCONCLR        /* 0xBF800A04 */
  .extern NVMCONSET        /* 0xBF800A08 */
  .extern NVMCONINV        /* 0xBF800A0C */
  .extern NVMKEY           /* 0xBF800A10 */
  .extern NVMADDR          /* 0xBF800A20 */
  .extern NVMADDRCLR       /* 0xBF800A24 */
  .extern NVMADDRSET       /* 0xBF800A28 */
  .extern NVMADDRINV       /* 0xBF800A2C */
  .extern NVMDATA0         /* 0xBF800A30 */
  .extern NVMDATA0CLR      /* 0xBF800A34 */
  .extern NVMDATA0SET      /* 0xBF800A38 */
  .extern NVMDATA0INV      /* 0xBF800A3C */
  .extern NVMDATA1         /* 0xBF800A40 */
  .extern NVMDATA1CLR      /* 0xBF800A44 */
  .extern NVMDATA1SET      /* 0xBF800A48 */
  .extern NVMDATA1INV      /* 0xBF800A4C */
  .extern NVMDATA2         /* 0xBF800A50 */
  .extern NVMDATA2CLR      /* 0xBF800A54 */
  .extern NVMDATA2SET      /* 0xBF800A58 */
  .extern NVMDATA2INV      /* 0xBF800A5C */
  .extern NVMDATA3         /* 0xBF800A60 */
  .extern NVMDATA3CLR      /* 0xBF800A64 */
  .extern NVMDATA3SET      /* 0xBF800A68 */
  .extern NVMDATA3INV      /* 0xBF800A6C */
  .extern NVMSRCADDR       /* 0xBF800A70 */
  .extern NVMSRCADDRCLR    /* 0xBF800A74 */
  .extern NVMSRCADDRSET    /* 0xBF800A78 */
  .extern NVMSRCADDRINV    /* 0xBF800A7C */
  .extern NVMPWP           /* 0xBF800A80 */
  .extern NVMPWPCLR        /* 0xBF800A84 */
  .extern NVMPWPSET        /* 0xBF800A88 */
  .extern NVMPWPINV        /* 0xBF800A8C */
  .extern NVMBWP           /* 0xBF800A90 */
  .extern NVMBWPCLR        /* 0xBF800A94 */
  .extern NVMBWPSET        /* 0xBF800A98 */
  .extern NVMBWPINV        /* 0xBF800A9C */
  .extern NVMCON2          /* 0xBF800AA0 */
  .extern NVMCON2CLR       /* 0xBF800AA4 */
  .extern NVMCON2SET       /* 0xBF800AA8 */
  .extern NVMCON2INV       /* 0xBF800AAC */
  .extern WDTCON           /* 0xBF800C00 */
  .extern WDTCONCLR        /* 0xBF800C04 */
  .extern WDTCONSET        /* 0xBF800C08 */
  .extern WDTCONINV        /* 0xBF800C0C */
  .extern DMTCON           /* 0xBF800E00 */
  .extern DMTPRECLR        /* 0xBF800E10 */
  .extern DMTCLR           /* 0xBF800E20 */
  .extern DMTSTAT          /* 0xBF800E30 */
  .extern DMTCNT           /* 0xBF800E40 */
  .extern DMTPSCNT         /* 0xBF800E60 */
  .extern DMTPSINTV        /* 0xBF800E70 */
  .extern _ICDCON          /* 0xBF801000 */
  .extern _ICDSTAT         /* 0xBF801010 */
  .extern OSCCON           /* 0xBF801200 */
  .extern OSCCONCLR        /* 0xBF801204 */
  .extern OSCCONSET        /* 0xBF801208 */
  .extern OSCCONINV        /* 0xBF80120C */
  .extern OSCTUN           /* 0xBF801210 */
  .extern OSCTUNCLR        /* 0xBF801214 */
  .extern OSCTUNSET        /* 0xBF801218 */
  .extern OSCTUNINV        /* 0xBF80121C */
  .extern SPLLCON          /* 0xBF801220 */
  .extern SPLLCONCLR       /* 0xBF801224 */
  .extern SPLLCONSET       /* 0xBF801228 */
  .extern SPLLCONINV       /* 0xBF80122C */
  .extern RCON             /* 0xBF801240 */
  .extern RCONCLR          /* 0xBF801244 */
  .extern RCONSET          /* 0xBF801248 */
  .extern RCONINV          /* 0xBF80124C */
  .extern RSWRST           /* 0xBF801250 */
  .extern RSWRSTCLR        /* 0xBF801254 */
  .extern RSWRSTSET        /* 0xBF801258 */
  .extern RSWRSTINV        /* 0xBF80125C */
  .extern RNMICON          /* 0xBF801260 */
  .extern RNMICONCLR       /* 0xBF801264 */
  .extern RNMICONSET       /* 0xBF801268 */
  .extern RNMICONINV       /* 0xBF80126C */
  .extern PWRCON           /* 0xBF801270 */
  .extern PWRCONCLR        /* 0xBF801274 */
  .extern PWRCONSET        /* 0xBF801278 */
  .extern PWRCONINV        /* 0xBF80127C */
  .extern REFO1CON         /* 0xBF801280 */
  .extern REFO1CONCLR      /* 0xBF801284 */
  .extern REFO1CONSET      /* 0xBF801288 */
  .extern REFO1CONINV      /* 0xBF80128C */
  .extern REFO1TRIM        /* 0xBF801290 */
  .extern REFO1TRIMCLR     /* 0xBF801294 */
  .extern REFO1TRIMSET     /* 0xBF801298 */
  .extern REFO1TRIMINV     /* 0xBF80129C */
  .extern REFO2CON         /* 0xBF8012A0 */
  .extern REFO2CONCLR      /* 0xBF8012A4 */
  .extern REFO2CONSET      /* 0xBF8012A8 */
  .extern REFO2CONINV      /* 0xBF8012AC */
  .extern REFO2TRIM        /* 0xBF8012B0 */
  .extern REFO2TRIMCLR     /* 0xBF8012B4 */
  .extern REFO2TRIMSET     /* 0xBF8012B8 */
  .extern REFO2TRIMINV     /* 0xBF8012BC */
  .extern REFO3CON         /* 0xBF8012C0 */
  .extern REFO3CONCLR      /* 0xBF8012C4 */
  .extern REFO3CONSET      /* 0xBF8012C8 */
  .extern REFO3CONINV      /* 0xBF8012CC */
  .extern REFO3TRIM        /* 0xBF8012D0 */
  .extern REFO3TRIMCLR     /* 0xBF8012D4 */
  .extern REFO3TRIMSET     /* 0xBF8012D8 */
  .extern REFO3TRIMINV     /* 0xBF8012DC */
  .extern REFO4CON         /* 0xBF8012E0 */
  .extern REFO4CONCLR      /* 0xBF8012E4 */
  .extern REFO4CONSET      /* 0xBF8012E8 */
  .extern REFO4CONINV      /* 0xBF8012EC */
  .extern REFO4TRIM        /* 0xBF8012F0 */
  .extern REFO4TRIMCLR     /* 0xBF8012F4 */
  .extern REFO4TRIMSET     /* 0xBF8012F8 */
  .extern REFO4TRIMINV     /* 0xBF8012FC */
  .extern PB1DIV           /* 0xBF801300 */
  .extern PB1DIVCLR        /* 0xBF801304 */
  .extern PB1DIVSET        /* 0xBF801308 */
  .extern PB1DIVINV        /* 0xBF80130C */
  .extern PB2DIV           /* 0xBF801310 */
  .extern PB2DIVCLR        /* 0xBF801314 */
  .extern PB2DIVSET        /* 0xBF801318 */
  .extern PB2DIVINV        /* 0xBF80131C */
  .extern PB4DIV           /* 0xBF801330 */
  .extern PB4DIVCLR        /* 0xBF801334 */
  .extern PB4DIVSET        /* 0xBF801338 */
  .extern PB4DIVINV        /* 0xBF80133C */
  .extern PB5DIV           /* 0xBF801340 */
  .extern PB5DIVCLR        /* 0xBF801344 */
  .extern PB5DIVSET        /* 0xBF801348 */
  .extern PB5DIVINV        /* 0xBF80134C */
  .extern PB6DIV           /* 0xBF801350 */
  .extern PB6DIVCLR        /* 0xBF801354 */
  .extern PB6DIVSET        /* 0xBF801358 */
  .extern PB6DIVINV        /* 0xBF80135C */
  .extern SLEWCON          /* 0xBF801380 */
  .extern SLEWCONCLR       /* 0xBF801384 */
  .extern SLEWCONSET       /* 0xBF801388 */
  .extern SLEWCONINV       /* 0xBF80138C */
  .extern CLKSTAT          /* 0xBF801390 */
  .extern CLKSTATCLR       /* 0xBF801394 */
  .extern CLKSTATSET       /* 0xBF801398 */
  .extern CLKSTATINV       /* 0xBF80139C */
  .extern INT1R            /* 0xBF801404 */
  .extern INT2R            /* 0xBF801408 */
  .extern INT3R            /* 0xBF80140C */
  .extern INT4R            /* 0xBF801410 */
  .extern T2CKR            /* 0xBF801418 */
  .extern T3CKR            /* 0xBF80141C */
  .extern T4CKR            /* 0xBF801420 */
  .extern T5CKR            /* 0xBF801424 */
  .extern IC1R             /* 0xBF801438 */
  .extern IC2R             /* 0xBF80143C */
  .extern IC3R             /* 0xBF801440 */
  .extern IC4R             /* 0xBF801444 */
  .extern OCFAR            /* 0xBF80145C */
  .extern OCFBR            /* 0xBF801460 */
  .extern U1RXR            /* 0xBF801464 */
  .extern U1CTSR           /* 0xBF801468 */
  .extern U2RXR            /* 0xBF80146C */
  .extern U2CTSR           /* 0xBF801470 */
  .extern U3RXR            /* 0xBF801474 */
  .extern U3CTSR           /* 0xBF801478 */
  .extern U4RXR            /* 0xBF80147C */
  .extern U4CTSR           /* 0xBF801480 */
  .extern U5RXR            /* 0xBF801484 */
  .extern U5CTSR           /* 0xBF801488 */
  .extern U6RXR            /* 0xBF80148C */
  .extern U6CTSR           /* 0xBF801490 */
  .extern SDI1R            /* 0xBF801498 */
  .extern SS1R             /* 0xBF80149C */
  .extern SCK2R            /* 0xBF8014A0 */
  .extern SDI2R            /* 0xBF8014A4 */
  .extern SS2R             /* 0xBF8014A8 */
  .extern SCK3R            /* 0xBF8014AC */
  .extern SDI3R            /* 0xBF8014B0 */
  .extern SS3R             /* 0xBF8014B4 */
  .extern SCK4R            /* 0xBF8014B8 */
  .extern SDI4R            /* 0xBF8014BC */
  .extern SS4R             /* 0xBF8014C0 */
  .extern REFIR            /* 0xBF8014CC */
  .extern QEA1R            /* 0xBF8014D0 */
  .extern QEB1R            /* 0xBF8014D4 */
  .extern INDX1R           /* 0xBF8014D8 */
  .extern HOME1R           /* 0xBF8014DC */
  .extern QEA2R            /* 0xBF8014E0 */
  .extern QEB2R            /* 0xBF8014E4 */
  .extern INDX2R           /* 0xBF8014E8 */
  .extern HOME2R           /* 0xBF8014EC */
  .extern FLT1R            /* 0xBF8014F0 */
  .extern FLT2R            /* 0xBF8014F4 */
  .extern CLCINAR          /* 0xBF801574 */
  .extern CLCINBR          /* 0xBF801578 */
  .extern CLCINCR          /* 0xBF80157C */
  .extern CLCINDR          /* 0xBF801580 */
  .extern RPA0R            /* 0xBF801600 */
  .extern RPA1R            /* 0xBF801604 */
  .extern RPA2R            /* 0xBF801608 */
  .extern RPA3R            /* 0xBF80160C */
  .extern RPA4R            /* 0xBF801610 */
  .extern RPA7R            /* 0xBF80161C */
  .extern RPA8R            /* 0xBF801620 */
  .extern RPA11R           /* 0xBF80162C */
  .extern RPA12R           /* 0xBF801630 */
  .extern RPB0R            /* 0xBF801640 */
  .extern RPB1R            /* 0xBF801644 */
  .extern RPB2R            /* 0xBF801648 */
  .extern RPB3R            /* 0xBF80164C */
  .extern RPB4R            /* 0xBF801650 */
  .extern RPB5R            /* 0xBF801654 */
  .extern RPB6R            /* 0xBF801658 */
  .extern RPB7R            /* 0xBF80165C */
  .extern RPB9R            /* 0xBF801664 */
  .extern RPB10R           /* 0xBF801668 */
  .extern RPB11R           /* 0xBF80166C */
  .extern RPB12R           /* 0xBF801670 */
  .extern RPB13R           /* 0xBF801674 */
  .extern RPB14R           /* 0xBF801678 */
  .extern RPB15R           /* 0xBF80167C */
  .extern RPC0R            /* 0xBF801680 */
  .extern RPC1R            /* 0xBF801684 */
  .extern RPC2R            /* 0xBF801688 */
  .extern RPC6R            /* 0xBF801698 */
  .extern RPC7R            /* 0xBF80169C */
  .extern RPC8R            /* 0xBF8016A0 */
  .extern RPC9R            /* 0xBF8016A4 */
  .extern RPC10R           /* 0xBF8016A8 */
  .extern RPC12R           /* 0xBF8016B0 */
  .extern RPC15R           /* 0xBF8016BC */
  .extern RPD8R            /* 0xBF8016E0 */
  .extern HLVDCON          /* 0xBF801800 */
  .extern HLVDCONCLR       /* 0xBF801804 */
  .extern HLVDCONSET       /* 0xBF801808 */
  .extern HLVDCONINV       /* 0xBF80180C */
  .extern INTCON           /* 0xBF810000 */
  .extern INTCONCLR        /* 0xBF810004 */
  .extern INTCONSET        /* 0xBF810008 */
  .extern INTCONINV        /* 0xBF81000C */
  .extern PRISS            /* 0xBF810010 */
  .extern PRISSCLR         /* 0xBF810014 */
  .extern PRISSSET         /* 0xBF810018 */
  .extern PRISSINV         /* 0xBF81001C */
  .extern INTSTAT          /* 0xBF810020 */
  .extern INTSTATCLR       /* 0xBF810024 */
  .extern INTSTATSET       /* 0xBF810028 */
  .extern INTSTATINV       /* 0xBF81002C */
  .extern IPTMR            /* 0xBF810030 */
  .extern IPTMRCLR         /* 0xBF810034 */
  .extern IPTMRSET         /* 0xBF810038 */
  .extern IPTMRINV         /* 0xBF81003C */
  .extern IFS0             /* 0xBF810040 */
  .extern IFS0CLR          /* 0xBF810044 */
  .extern IFS0SET          /* 0xBF810048 */
  .extern IFS0INV          /* 0xBF81004C */
  .extern IFS1             /* 0xBF810050 */
  .extern IFS1CLR          /* 0xBF810054 */
  .extern IFS1SET          /* 0xBF810058 */
  .extern IFS1INV          /* 0xBF81005C */
  .extern IFS2             /* 0xBF810060 */
  .extern IFS2CLR          /* 0xBF810064 */
  .extern IFS2SET          /* 0xBF810068 */
  .extern IFS2INV          /* 0xBF81006C */
  .extern IFS3             /* 0xBF810070 */
  .extern IFS3CLR          /* 0xBF810074 */
  .extern IFS3SET          /* 0xBF810078 */
  .extern IFS3INV          /* 0xBF81007C */
  .extern IFS4             /* 0xBF810080 */
  .extern IFS4CLR          /* 0xBF810084 */
  .extern IFS4SET          /* 0xBF810088 */
  .extern IFS4INV          /* 0xBF81008C */
  .extern IFS5             /* 0xBF810090 */
  .extern IFS5CLR          /* 0xBF810094 */
  .extern IFS5SET          /* 0xBF810098 */
  .extern IFS5INV          /* 0xBF81009C */
  .extern IFS7             /* 0xBF8100B0 */
  .extern IFS7CLR          /* 0xBF8100B4 */
  .extern IFS7SET          /* 0xBF8100B8 */
  .extern IFS7INV          /* 0xBF8100BC */
  .extern IEC0             /* 0xBF8100C0 */
  .extern IEC0CLR          /* 0xBF8100C4 */
  .extern IEC0SET          /* 0xBF8100C8 */
  .extern IEC0INV          /* 0xBF8100CC */
  .extern IEC1             /* 0xBF8100D0 */
  .extern IEC1CLR          /* 0xBF8100D4 */
  .extern IEC1SET          /* 0xBF8100D8 */
  .extern IEC1INV          /* 0xBF8100DC */
  .extern IEC2             /* 0xBF8100E0 */
  .extern IEC2CLR          /* 0xBF8100E4 */
  .extern IEC2SET          /* 0xBF8100E8 */
  .extern IEC2INV          /* 0xBF8100EC */
  .extern IEC3             /* 0xBF8100F0 */
  .extern IEC3CLR          /* 0xBF8100F4 */
  .extern IEC3SET          /* 0xBF8100F8 */
  .extern IEC3INV          /* 0xBF8100FC */
  .extern IEC4             /* 0xBF810100 */
  .extern IEC4CLR          /* 0xBF810104 */
  .extern IEC4SET          /* 0xBF810108 */
  .extern IEC4INV          /* 0xBF81010C */
  .extern IEC5             /* 0xBF810110 */
  .extern IEC5CLR          /* 0xBF810114 */
  .extern IEC5SET          /* 0xBF810118 */
  .extern IEC5INV          /* 0xBF81011C */
  .extern IEC7             /* 0xBF810130 */
  .extern IEC7CLR          /* 0xBF810134 */
  .extern IEC7SET          /* 0xBF810138 */
  .extern IEC7INV          /* 0xBF81013C */
  .extern IPC0             /* 0xBF810140 */
  .extern IPC0CLR          /* 0xBF810144 */
  .extern IPC0SET          /* 0xBF810148 */
  .extern IPC0INV          /* 0xBF81014C */
  .extern IPC1             /* 0xBF810150 */
  .extern IPC1CLR          /* 0xBF810154 */
  .extern IPC1SET          /* 0xBF810158 */
  .extern IPC1INV          /* 0xBF81015C */
  .extern IPC2             /* 0xBF810160 */
  .extern IPC2CLR          /* 0xBF810164 */
  .extern IPC2SET          /* 0xBF810168 */
  .extern IPC2INV          /* 0xBF81016C */
  .extern IPC3             /* 0xBF810170 */
  .extern IPC3CLR          /* 0xBF810174 */
  .extern IPC3SET          /* 0xBF810178 */
  .extern IPC3INV          /* 0xBF81017C */
  .extern IPC4             /* 0xBF810180 */
  .extern IPC4CLR          /* 0xBF810184 */
  .extern IPC4SET          /* 0xBF810188 */
  .extern IPC4INV          /* 0xBF81018C */
  .extern IPC5             /* 0xBF810190 */
  .extern IPC5CLR          /* 0xBF810194 */
  .extern IPC5SET          /* 0xBF810198 */
  .extern IPC5INV          /* 0xBF81019C */
  .extern IPC6             /* 0xBF8101A0 */
  .extern IPC6CLR          /* 0xBF8101A4 */
  .extern IPC6SET          /* 0xBF8101A8 */
  .extern IPC6INV          /* 0xBF8101AC */
  .extern IPC7             /* 0xBF8101B0 */
  .extern IPC7CLR          /* 0xBF8101B4 */
  .extern IPC7SET          /* 0xBF8101B8 */
  .extern IPC7INV          /* 0xBF8101BC */
  .extern IPC8             /* 0xBF8101C0 */
  .extern IPC8CLR          /* 0xBF8101C4 */
  .extern IPC8SET          /* 0xBF8101C8 */
  .extern IPC8INV          /* 0xBF8101CC */
  .extern IPC9             /* 0xBF8101D0 */
  .extern IPC9CLR          /* 0xBF8101D4 */
  .extern IPC9SET          /* 0xBF8101D8 */
  .extern IPC9INV          /* 0xBF8101DC */
  .extern IPC10            /* 0xBF8101E0 */
  .extern IPC10CLR         /* 0xBF8101E4 */
  .extern IPC10SET         /* 0xBF8101E8 */
  .extern IPC10INV         /* 0xBF8101EC */
  .extern IPC11            /* 0xBF8101F0 */
  .extern IPC11CLR         /* 0xBF8101F4 */
  .extern IPC11SET         /* 0xBF8101F8 */
  .extern IPC11INV         /* 0xBF8101FC */
  .extern IPC13            /* 0xBF810210 */
  .extern IPC13CLR         /* 0xBF810214 */
  .extern IPC13SET         /* 0xBF810218 */
  .extern IPC13INV         /* 0xBF81021C */
  .extern IPC14            /* 0xBF810220 */
  .extern IPC14CLR         /* 0xBF810224 */
  .extern IPC14SET         /* 0xBF810228 */
  .extern IPC14INV         /* 0xBF81022C */
  .extern IPC15            /* 0xBF810230 */
  .extern IPC15CLR         /* 0xBF810234 */
  .extern IPC15SET         /* 0xBF810238 */
  .extern IPC15INV         /* 0xBF81023C */
  .extern IPC17            /* 0xBF810250 */
  .extern IPC17CLR         /* 0xBF810254 */
  .extern IPC17SET         /* 0xBF810258 */
  .extern IPC17INV         /* 0xBF81025C */
  .extern IPC18            /* 0xBF810260 */
  .extern IPC18CLR         /* 0xBF810264 */
  .extern IPC18SET         /* 0xBF810268 */
  .extern IPC18INV         /* 0xBF81026C */
  .extern IPC23            /* 0xBF8102B0 */
  .extern IPC23CLR         /* 0xBF8102B4 */
  .extern IPC23SET         /* 0xBF8102B8 */
  .extern IPC23INV         /* 0xBF8102BC */
  .extern IPC24            /* 0xBF8102C0 */
  .extern IPC24CLR         /* 0xBF8102C4 */
  .extern IPC24SET         /* 0xBF8102C8 */
  .extern IPC24INV         /* 0xBF8102CC */
  .extern IPC25            /* 0xBF8102D0 */
  .extern IPC25CLR         /* 0xBF8102D4 */
  .extern IPC25SET         /* 0xBF8102D8 */
  .extern IPC25INV         /* 0xBF8102DC */
  .extern IPC26            /* 0xBF8102E0 */
  .extern IPC26CLR         /* 0xBF8102E4 */
  .extern IPC26SET         /* 0xBF8102E8 */
  .extern IPC26INV         /* 0xBF8102EC */
  .extern IPC27            /* 0xBF8102F0 */
  .extern IPC27CLR         /* 0xBF8102F4 */
  .extern IPC27SET         /* 0xBF8102F8 */
  .extern IPC27INV         /* 0xBF8102FC */
  .extern IPC28            /* 0xBF810300 */
  .extern IPC28CLR         /* 0xBF810304 */
  .extern IPC28SET         /* 0xBF810308 */
  .extern IPC28INV         /* 0xBF81030C */
  .extern IPC29            /* 0xBF810310 */
  .extern IPC29CLR         /* 0xBF810314 */
  .extern IPC29SET         /* 0xBF810318 */
  .extern IPC29INV         /* 0xBF81031C */
  .extern IPC30            /* 0xBF810320 */
  .extern IPC30CLR         /* 0xBF810324 */
  .extern IPC30SET         /* 0xBF810328 */
  .extern IPC30INV         /* 0xBF81032C */
  .extern IPC39            /* 0xBF8103B0 */
  .extern IPC39CLR         /* 0xBF8103B4 */
  .extern IPC39SET         /* 0xBF8103B8 */
  .extern IPC39INV         /* 0xBF8103BC */
  .extern IPC40            /* 0xBF8103C0 */
  .extern IPC40CLR         /* 0xBF8103C4 */
  .extern IPC40SET         /* 0xBF8103C8 */
  .extern IPC40INV         /* 0xBF8103CC */
  .extern IPC42            /* 0xBF8103E0 */
  .extern IPC42CLR         /* 0xBF8103E4 */
  .extern IPC42SET         /* 0xBF8103E8 */
  .extern IPC42INV         /* 0xBF8103EC */
  .extern IPC43            /* 0xBF8103F0 */
  .extern IPC43CLR         /* 0xBF8103F4 */
  .extern IPC43SET         /* 0xBF8103F8 */
  .extern IPC43INV         /* 0xBF8103FC */
  .extern IPC44            /* 0xBF810400 */
  .extern IPC44CLR         /* 0xBF810404 */
  .extern IPC44SET         /* 0xBF810408 */
  .extern IPC44INV         /* 0xBF81040C */
  .extern IPC45            /* 0xBF810410 */
  .extern IPC45CLR         /* 0xBF810414 */
  .extern IPC45SET         /* 0xBF810418 */
  .extern IPC45INV         /* 0xBF81041C */
  .extern IPC46            /* 0xBF810420 */
  .extern IPC46CLR         /* 0xBF810424 */
  .extern IPC46SET         /* 0xBF810428 */
  .extern IPC46INV         /* 0xBF81042C */
  .extern IPC57            /* 0xBF8104D0 */
  .extern IPC57CLR         /* 0xBF8104D4 */
  .extern IPC57SET         /* 0xBF8104D8 */
  .extern IPC57INV         /* 0xBF8104DC */
  .extern IPC62            /* 0xBF810520 */
  .extern IPC62CLR         /* 0xBF810524 */
  .extern IPC62SET         /* 0xBF810528 */
  .extern IPC62INV         /* 0xBF81052C */
  .extern IPC63            /* 0xBF810530 */
  .extern IPC63CLR         /* 0xBF810534 */
  .extern IPC63SET         /* 0xBF810538 */
  .extern IPC63INV         /* 0xBF81053C */
  .extern OFF000           /* 0xBF810540 */
  .extern OFF001           /* 0xBF810544 */
  .extern OFF002           /* 0xBF810548 */
  .extern OFF003           /* 0xBF81054C */
  .extern OFF004           /* 0xBF810550 */
  .extern OFF005           /* 0xBF810554 */
  .extern OFF006           /* 0xBF810558 */
  .extern OFF007           /* 0xBF81055C */
  .extern OFF008           /* 0xBF810560 */
  .extern OFF009           /* 0xBF810564 */
  .extern OFF010           /* 0xBF810568 */
  .extern OFF011           /* 0xBF81056C */
  .extern OFF012           /* 0xBF810570 */
  .extern OFF013           /* 0xBF810574 */
