Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
#define _IFS1_CNBIF_POSITION                     0x0000000D
#define _IFS1_CNBIF_MASK                         0x00002000
#define _IFS1_CNBIF_LENGTH                       0x00000001

#define _IFS1_CNCIF_POSITION                     0x0000000E
#define _IFS1_CNCIF_MASK                         0x00004000
#define _IFS1_CNCIF_LENGTH                       0x00000001

#define _IFS1_CNDIF_POSITION                     0x0000000F
#define _IFS1_CNDIF_MASK                         0x00008000
#define _IFS1_CNDIF_LENGTH                       0x00000001

#define _IFS1_SPI2EIF_POSITION                   0x00000015
#define _IFS1_SPI2EIF_MASK                       0x00200000
#define _IFS1_SPI2EIF_LENGTH                     0x00000001

#define _IFS1_SPI2RXIF_POSITION                  0x00000016
#define _IFS1_SPI2RXIF_MASK                      0x00400000
#define _IFS1_SPI2RXIF_LENGTH                    0x00000001

#define _IFS1_SPI2TXIF_POSITION                  0x00000017
#define _IFS1_SPI2TXIF_MASK                      0x00800000
#define _IFS1_SPI2TXIF_LENGTH                    0x00000001

#define _IFS1_U2EIF_POSITION                     0x00000018
#define _IFS1_U2EIF_MASK                         0x01000000
#define _IFS1_U2EIF_LENGTH                       0x00000001

#define _IFS1_U2RXIF_POSITION                    0x00000019
#define _IFS1_U2RXIF_MASK                        0x02000000
#define _IFS1_U2RXIF_LENGTH                      0x00000001

#define _IFS1_U2TXIF_POSITION                    0x0000001A
#define _IFS1_U2TXIF_MASK                        0x04000000
#define _IFS1_U2TXIF_LENGTH                      0x00000001

#define _IFS1_I2C2BIF_POSITION                   0x0000001B
#define _IFS1_I2C2BIF_MASK                       0x08000000
#define _IFS1_I2C2BIF_LENGTH                     0x00000001

#define _IFS1_I2C2SIF_POSITION                   0x0000001C
#define _IFS1_I2C2SIF_MASK                       0x10000000
#define _IFS1_I2C2SIF_LENGTH                     0x00000001

#define _IFS1_I2C2MIF_POSITION                   0x0000001D
#define _IFS1_I2C2MIF_MASK                       0x20000000
#define _IFS1_I2C2MIF_LENGTH                     0x00000001

#define _IFS1_w_POSITION                         0x00000000
#define _IFS1_w_MASK                             0xFFFFFFFF
#define _IFS1_w_LENGTH                           0x00000020

#define _IFS2_CTMUIF_POSITION                    0x00000007
#define _IFS2_CTMUIF_MASK                        0x00000080
#define _IFS2_CTMUIF_LENGTH                      0x00000001

#define _IFS2_DMA0IF_POSITION                    0x00000008
#define _IFS2_DMA0IF_MASK                        0x00000100
#define _IFS2_DMA0IF_LENGTH                      0x00000001

#define _IFS2_DMA1IF_POSITION                    0x00000009
#define _IFS2_DMA1IF_MASK                        0x00000200
#define _IFS2_DMA1IF_LENGTH                      0x00000001

#define _IFS2_DMA2IF_POSITION                    0x0000000A
#define _IFS2_DMA2IF_MASK                        0x00000400
#define _IFS2_DMA2IF_LENGTH                      0x00000001

#define _IFS2_DMA3IF_POSITION                    0x0000000B
#define _IFS2_DMA3IF_MASK                        0x00000800
#define _IFS2_DMA3IF_LENGTH                      0x00000001

#define _IFS2_AD1IF_POSITION                     0x0000001C
#define _IFS2_AD1IF_MASK                         0x10000000
#define _IFS2_AD1IF_LENGTH                       0x00000001

#define _IFS2_AD1DC1IF_POSITION                  0x0000001E
#define _IFS2_AD1DC1IF_MASK                      0x40000000
#define _IFS2_AD1DC1IF_LENGTH                    0x00000001

#define _IFS2_AD1DC2IF_POSITION                  0x0000001F
#define _IFS2_AD1DC2IF_MASK                      0x80000000
#define _IFS2_AD1DC2IF_LENGTH                    0x00000001

#define _IFS2_w_POSITION                         0x00000000
#define _IFS2_w_MASK                             0xFFFFFFFF
#define _IFS2_w_LENGTH                           0x00000020

#define _IFS3_AD1DF1IF_POSITION                  0x00000000
#define _IFS3_AD1DF1IF_MASK                      0x00000001
#define _IFS3_AD1DF1IF_LENGTH                    0x00000001

#define _IFS3_AD1DF2IF_POSITION                  0x00000001
#define _IFS3_AD1DF2IF_MASK                      0x00000002
#define _IFS3_AD1DF2IF_LENGTH                    0x00000001

#define _IFS3_AD1DF3IF_POSITION                  0x00000002
#define _IFS3_AD1DF3IF_MASK                      0x00000004
#define _IFS3_AD1DF3IF_LENGTH                    0x00000001

#define _IFS3_AD1DF4IF_POSITION                  0x00000003
#define _IFS3_AD1DF4IF_MASK                      0x00000008
#define _IFS3_AD1DF4IF_LENGTH                    0x00000001

#define _IFS3_AD1FIIF_POSITION                   0x00000004
#define _IFS3_AD1FIIF_MASK                       0x00000010
#define _IFS3_AD1FIIF_LENGTH                     0x00000001

#define _IFS3_AD1EOSIF_POSITION                  0x00000005
#define _IFS3_AD1EOSIF_MASK                      0x00000020
#define _IFS3_AD1EOSIF_LENGTH                    0x00000001

#define _IFS3_AD1ARIF_POSITION                   0x00000006
#define _IFS3_AD1ARIF_MASK                       0x00000040
#define _IFS3_AD1ARIF_LENGTH                     0x00000001

#define _IFS3_AD1RSIF_POSITION                   0x00000007
#define _IFS3_AD1RSIF_MASK                       0x00000080
#define _IFS3_AD1RSIF_LENGTH                     0x00000001

#define _IFS3_AD1FCBTIF_POSITION                 0x00000008
#define _IFS3_AD1FCBTIF_MASK                     0x00000100
#define _IFS3_AD1FCBTIF_LENGTH                   0x00000001

#define _IFS3_AD1GIF_POSITION                    0x00000009
#define _IFS3_AD1GIF_MASK                        0x00000200
#define _IFS3_AD1GIF_LENGTH                      0x00000001

#define _IFS3_AD1D0IF_POSITION                   0x0000000A
#define _IFS3_AD1D0IF_MASK                       0x00000400
#define _IFS3_AD1D0IF_LENGTH                     0x00000001

#define _IFS3_AD1D1IF_POSITION                   0x0000000B
#define _IFS3_AD1D1IF_MASK                       0x00000800
#define _IFS3_AD1D1IF_LENGTH                     0x00000001

#define _IFS3_AD1D2IF_POSITION                   0x0000000C
#define _IFS3_AD1D2IF_MASK                       0x00001000
#define _IFS3_AD1D2IF_LENGTH                     0x00000001

#define _IFS3_AD1D3IF_POSITION                   0x0000000D
#define _IFS3_AD1D3IF_MASK                       0x00002000
#define _IFS3_AD1D3IF_LENGTH                     0x00000001

#define _IFS3_AD1D4IF_POSITION                   0x0000000E
#define _IFS3_AD1D4IF_MASK                       0x00004000
#define _IFS3_AD1D4IF_LENGTH                     0x00000001

