Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
#define _IEC3_AD1D12IE_POSITION                  0x00000016
#define _IEC3_AD1D12IE_MASK                      0x00400000
#define _IEC3_AD1D12IE_LENGTH                    0x00000001

#define _IEC3_AD1D13IE_POSITION                  0x00000017
#define _IEC3_AD1D13IE_MASK                      0x00800000
#define _IEC3_AD1D13IE_LENGTH                    0x00000001

#define _IEC3_AD1D15IE_POSITION                  0x00000019
#define _IEC3_AD1D15IE_MASK                      0x02000000
#define _IEC3_AD1D15IE_LENGTH                    0x00000001

#define _IEC3_AD1D16IE_POSITION                  0x0000001A
#define _IEC3_AD1D16IE_MASK                      0x04000000
#define _IEC3_AD1D16IE_LENGTH                    0x00000001

#define _IEC3_AD1D17IE_POSITION                  0x0000001B
#define _IEC3_AD1D17IE_MASK                      0x08000000
#define _IEC3_AD1D17IE_LENGTH                    0x00000001

#define _IEC3_w_POSITION                         0x00000000
#define _IEC3_w_MASK                             0xFFFFFFFF
#define _IEC3_w_LENGTH                           0x00000020

#define _IEC4_AD1D50IE_POSITION                  0x0000001C
#define _IEC4_AD1D50IE_MASK                      0x10000000
#define _IEC4_AD1D50IE_LENGTH                    0x00000001

#define _IEC4_AD1D53IE_POSITION                  0x0000001F
#define _IEC4_AD1D53IE_MASK                      0x80000000
#define _IEC4_AD1D53IE_LENGTH                    0x00000001

#define _IEC4_w_POSITION                         0x00000000
#define _IEC4_w_MASK                             0xFFFFFFFF
#define _IEC4_w_LENGTH                           0x00000020

#define _IEC5_QEI1IE_POSITION                    0x00000009
#define _IEC5_QEI1IE_MASK                        0x00000200
#define _IEC5_QEI1IE_LENGTH                      0x00000001

#define _IEC5_QEI2IE_POSITION                    0x0000000A
#define _IEC5_QEI2IE_MASK                        0x00000400
#define _IEC5_QEI2IE_LENGTH                      0x00000001

#define _IEC5_PWMPEVTIE_POSITION                 0x0000000B
#define _IEC5_PWMPEVTIE_MASK                     0x00000800
#define _IEC5_PWMPEVTIE_LENGTH                   0x00000001

#define _IEC5_PWMSEVTIE_POSITION                 0x0000000C
#define _IEC5_PWMSEVTIE_MASK                     0x00001000
#define _IEC5_PWMSEVTIE_LENGTH                   0x00000001

#define _IEC5_PWM1IE_POSITION                    0x0000000D
#define _IEC5_PWM1IE_MASK                        0x00002000
#define _IEC5_PWM1IE_LENGTH                      0x00000001

#define _IEC5_PWM2IE_POSITION                    0x0000000E
#define _IEC5_PWM2IE_MASK                        0x00004000
#define _IEC5_PWM2IE_LENGTH                      0x00000001

#define _IEC5_PWM3IE_POSITION                    0x0000000F
#define _IEC5_PWM3IE_MASK                        0x00008000
#define _IEC5_PWM3IE_LENGTH                      0x00000001

#define _IEC5_PWM4IE_POSITION                    0x00000010
#define _IEC5_PWM4IE_MASK                        0x00010000
#define _IEC5_PWM4IE_LENGTH                      0x00000001

#define _IEC5_DMA4IE_POSITION                    0x00000016
#define _IEC5_DMA4IE_MASK                        0x00400000
#define _IEC5_DMA4IE_LENGTH                      0x00000001

#define _IEC5_DMA5IE_POSITION                    0x00000017
#define _IEC5_DMA5IE_MASK                        0x00800000
#define _IEC5_DMA5IE_LENGTH                      0x00000001

#define _IEC5_DMA6IE_POSITION                    0x00000018
#define _IEC5_DMA6IE_MASK                        0x01000000
#define _IEC5_DMA6IE_LENGTH                      0x00000001

#define _IEC5_DMA7IE_POSITION                    0x00000019
#define _IEC5_DMA7IE_MASK                        0x02000000
#define _IEC5_DMA7IE_LENGTH                      0x00000001

#define _IEC5_w_POSITION                         0x00000000
#define _IEC5_w_MASK                             0xFFFFFFFF
#define _IEC5_w_LENGTH                           0x00000020

#define _IEC7_SBIE_POSITION                      0x00000006
#define _IEC7_SBIE_MASK                          0x00000040
#define _IEC7_SBIE_LENGTH                        0x00000001

#define _IEC7_PCACHEIE_POSITION                  0x00000017
#define _IEC7_PCACHEIE_MASK                      0x00800000
#define _IEC7_PCACHEIE_LENGTH                    0x00000001

#define _IEC7_CLC1IE_POSITION                    0x00000019
#define _IEC7_CLC1IE_MASK                        0x02000000
#define _IEC7_CLC1IE_LENGTH                      0x00000001

#define _IEC7_CPCIE_POSITION                     0x0000001E
#define _IEC7_CPCIE_MASK                         0x40000000
#define _IEC7_CPCIE_LENGTH                       0x00000001

#define _IEC7_CFDCIE_POSITION                    0x0000001F
#define _IEC7_CFDCIE_MASK                        0x80000000
#define _IEC7_CFDCIE_LENGTH                      0x00000001

#define _IEC7_w_POSITION                         0x00000000
#define _IEC7_w_MASK                             0xFFFFFFFF
#define _IEC7_w_LENGTH                           0x00000020

#define _IPC0_CTIS_POSITION                      0x00000000
#define _IPC0_CTIS_MASK                          0x00000003
#define _IPC0_CTIS_LENGTH                        0x00000002

#define _IPC0_CTIP_POSITION                      0x00000002
#define _IPC0_CTIP_MASK                          0x0000001C
#define _IPC0_CTIP_LENGTH                        0x00000003

#define _IPC0_CS0IS_POSITION                     0x00000008
#define _IPC0_CS0IS_MASK                         0x00000300
#define _IPC0_CS0IS_LENGTH                       0x00000002

#define _IPC0_CS0IP_POSITION                     0x0000000A
#define _IPC0_CS0IP_MASK                         0x00001C00
#define _IPC0_CS0IP_LENGTH                       0x00000003

#define _IPC0_CS1IS_POSITION                     0x00000010
#define _IPC0_CS1IS_MASK                         0x00030000
#define _IPC0_CS1IS_LENGTH                       0x00000002

#define _IPC0_CS1IP_POSITION                     0x00000012
#define _IPC0_CS1IP_MASK                         0x001C0000
#define _IPC0_CS1IP_LENGTH                       0x00000003

#define _IPC0_INT0IS_POSITION                    0x00000018
#define _IPC0_INT0IS_MASK                        0x03000000
#define _IPC0_INT0IS_LENGTH                      0x00000002

#define _IPC0_INT0IP_POSITION                    0x0000001A
#define _IPC0_INT0IP_MASK                        0x1C000000
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_w_POSITION                         0x00000000
#define _IPC0_w_MASK                             0xFFFFFFFF
#define _IPC0_w_LENGTH                           0x00000020

#define _IPC1_T1IS_POSITION                      0x00000000
#define _IPC1_T1IS_MASK                          0x00000003
#define _IPC1_T1IS_LENGTH                        0x00000002

#define _IPC1_T1IP_POSITION                      0x00000002
#define _IPC1_T1IP_MASK                          0x0000001C
#define _IPC1_T1IP_LENGTH                        0x00000003

#define _IPC1_IC1EIS_POSITION                    0x00000008
#define _IPC1_IC1EIS_MASK                        0x00000300
#define _IPC1_IC1EIS_LENGTH                      0x00000002

#define _IPC1_IC1EIP_POSITION                    0x0000000A
#define _IPC1_IC1EIP_MASK                        0x00001C00
#define _IPC1_IC1EIP_LENGTH                      0x00000003

