Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
#define _PWMCON3_CLIF_POSITION                   0x0000001E
#define _PWMCON3_CLIF_MASK                       0x40000000
#define _PWMCON3_CLIF_LENGTH                     0x00000001

#define _PWMCON3_FLTIF_POSITION                  0x0000001F
#define _PWMCON3_FLTIF_MASK                      0x80000000
#define _PWMCON3_FLTIF_LENGTH                    0x00000001

#define _IOCON3_OSYNC_POSITION                   0x00000000
#define _IOCON3_OSYNC_MASK                       0x00000001
#define _IOCON3_OSYNC_LENGTH                     0x00000001

#define _IOCON3_SWAP_POSITION                    0x00000001
#define _IOCON3_SWAP_MASK                        0x00000002
#define _IOCON3_SWAP_LENGTH                      0x00000001

#define _IOCON3_CLDAT_POSITION                   0x00000002
#define _IOCON3_CLDAT_MASK                       0x0000000C
#define _IOCON3_CLDAT_LENGTH                     0x00000002

#define _IOCON3_FLTDAT_POSITION                  0x00000004
#define _IOCON3_FLTDAT_MASK                      0x00000030
#define _IOCON3_FLTDAT_LENGTH                    0x00000002

#define _IOCON3_OVRDAT_POSITION                  0x00000006
#define _IOCON3_OVRDAT_MASK                      0x000000C0
#define _IOCON3_OVRDAT_LENGTH                    0x00000002

#define _IOCON3_OVRENL_POSITION                  0x00000008
#define _IOCON3_OVRENL_MASK                      0x00000100
#define _IOCON3_OVRENL_LENGTH                    0x00000001

#define _IOCON3_OVRENH_POSITION                  0x00000009
#define _IOCON3_OVRENH_MASK                      0x00000200
#define _IOCON3_OVRENH_LENGTH                    0x00000001

#define _IOCON3_PMOD_POSITION                    0x0000000A
#define _IOCON3_PMOD_MASK                        0x00000C00
#define _IOCON3_PMOD_LENGTH                      0x00000002

#define _IOCON3_POLL_POSITION                    0x0000000C
#define _IOCON3_POLL_MASK                        0x00001000
#define _IOCON3_POLL_LENGTH                      0x00000001

#define _IOCON3_POLH_POSITION                    0x0000000D
#define _IOCON3_POLH_MASK                        0x00002000
#define _IOCON3_POLH_LENGTH                      0x00000001

#define _IOCON3_PENL_POSITION                    0x0000000E
#define _IOCON3_PENL_MASK                        0x00004000
#define _IOCON3_PENL_LENGTH                      0x00000001

#define _IOCON3_PENH_POSITION                    0x0000000F
#define _IOCON3_PENH_MASK                        0x00008000
#define _IOCON3_PENH_LENGTH                      0x00000001

#define _IOCON3_FLTMOD_POSITION                  0x00000010
#define _IOCON3_FLTMOD_MASK                      0x00030000
#define _IOCON3_FLTMOD_LENGTH                    0x00000002

#define _IOCON3_FLTPOL_POSITION                  0x00000012
#define _IOCON3_FLTPOL_MASK                      0x00040000
#define _IOCON3_FLTPOL_LENGTH                    0x00000001

#define _IOCON3_FLTSRC_POSITION                  0x00000013
#define _IOCON3_FLTSRC_MASK                      0x00780000
#define _IOCON3_FLTSRC_LENGTH                    0x00000004

#define _IOCON3_CLMOD_POSITION                   0x00000018
#define _IOCON3_CLMOD_MASK                       0x01000000
#define _IOCON3_CLMOD_LENGTH                     0x00000001

#define _IOCON3_CLPOL_POSITION                   0x00000019
#define _IOCON3_CLPOL_MASK                       0x02000000
#define _IOCON3_CLPOL_LENGTH                     0x00000001

#define _IOCON3_CLSRC_POSITION                   0x0000001A
#define _IOCON3_CLSRC_MASK                       0x3C000000
#define _IOCON3_CLSRC_LENGTH                     0x00000004

#define _PDC3_PDC_POSITION                       0x00000000
#define _PDC3_PDC_MASK                           0x0000FFFF
#define _PDC3_PDC_LENGTH                         0x00000010

#define _SDC3_SDC_POSITION                       0x00000000
#define _SDC3_SDC_MASK                           0x0000FFFF
#define _SDC3_SDC_LENGTH                         0x00000010

#define _PHASE3_PHASE_POSITION                   0x00000000
#define _PHASE3_PHASE_MASK                       0x0000FFFF
#define _PHASE3_PHASE_LENGTH                     0x00000010

#define _DTR3_DTR_POSITION                       0x00000000
#define _DTR3_DTR_MASK                           0x0000FFFF
#define _DTR3_DTR_LENGTH                         0x00000010

#define _ALTDTR3_ALTDTR_POSITION                 0x00000000
#define _ALTDTR3_ALTDTR_MASK                     0x0000FFFF
#define _ALTDTR3_ALTDTR_LENGTH                   0x00000010

#define _DTCOMP3_COMP_POSITION                   0x00000000
#define _DTCOMP3_COMP_MASK                       0x00003FFF
#define _DTCOMP3_COMP_LENGTH                     0x0000000E

#define _TRIG3_TRGCMP_POSITION                   0x00000000
#define _TRIG3_TRGCMP_MASK                       0x0000FFFF
#define _TRIG3_TRGCMP_LENGTH                     0x00000010

#define _TRGCON3_STRGIS_POSITION                 0x00000006
#define _TRGCON3_STRGIS_MASK                     0x00000040
#define _TRGCON3_STRGIS_LENGTH                   0x00000001

#define _TRGCON3_DTM_POSITION                    0x00000007
#define _TRGCON3_DTM_MASK                        0x00000080
#define _TRGCON3_DTM_LENGTH                      0x00000001

#define _TRGCON3_STRGSEL_POSITION                0x00000008
#define _TRGCON3_STRGSEL_MASK                    0x00000300
#define _TRGCON3_STRGSEL_LENGTH                  0x00000002

#define _TRGCON3_TRGSEL_POSITION                 0x0000000A
#define _TRGCON3_TRGSEL_MASK                     0x00000C00
#define _TRGCON3_TRGSEL_LENGTH                   0x00000002

#define _TRGCON3_TRGDIV_POSITION                 0x0000000C
#define _TRGCON3_TRGDIV_MASK                     0x0000F000
#define _TRGCON3_TRGDIV_LENGTH                   0x00000004

#define _STRIG3_STRGCMP_POSITION                 0x00000000
#define _STRIG3_STRGCMP_MASK                     0x0000FFFF
#define _STRIG3_STRGCMP_LENGTH                   0x00000010

#define _CAP3_CAP_POSITION                       0x00000000
#define _CAP3_CAP_MASK                           0x0000FFFF
#define _CAP3_CAP_LENGTH                         0x00000010

#define _LEBCON3_CLLEBEN_POSITION                0x0000000A
#define _LEBCON3_CLLEBEN_MASK                    0x00000400
#define _LEBCON3_CLLEBEN_LENGTH                  0x00000001

