Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
#define _IOCON4_OVRENH_POSITION                  0x00000009
#define _IOCON4_OVRENH_MASK                      0x00000200
#define _IOCON4_OVRENH_LENGTH                    0x00000001

#define _IOCON4_PMOD_POSITION                    0x0000000A
#define _IOCON4_PMOD_MASK                        0x00000C00
#define _IOCON4_PMOD_LENGTH                      0x00000002

#define _IOCON4_POLL_POSITION                    0x0000000C
#define _IOCON4_POLL_MASK                        0x00001000
#define _IOCON4_POLL_LENGTH                      0x00000001

#define _IOCON4_POLH_POSITION                    0x0000000D
#define _IOCON4_POLH_MASK                        0x00002000
#define _IOCON4_POLH_LENGTH                      0x00000001

#define _IOCON4_PENL_POSITION                    0x0000000E
#define _IOCON4_PENL_MASK                        0x00004000
#define _IOCON4_PENL_LENGTH                      0x00000001

#define _IOCON4_PENH_POSITION                    0x0000000F
#define _IOCON4_PENH_MASK                        0x00008000
#define _IOCON4_PENH_LENGTH                      0x00000001

#define _IOCON4_FLTMOD_POSITION                  0x00000010
#define _IOCON4_FLTMOD_MASK                      0x00030000
#define _IOCON4_FLTMOD_LENGTH                    0x00000002

#define _IOCON4_FLTPOL_POSITION                  0x00000012
#define _IOCON4_FLTPOL_MASK                      0x00040000
#define _IOCON4_FLTPOL_LENGTH                    0x00000001

#define _IOCON4_FLTSRC_POSITION                  0x00000013
#define _IOCON4_FLTSRC_MASK                      0x00780000
#define _IOCON4_FLTSRC_LENGTH                    0x00000004

#define _IOCON4_CLMOD_POSITION                   0x00000018
#define _IOCON4_CLMOD_MASK                       0x01000000
#define _IOCON4_CLMOD_LENGTH                     0x00000001

#define _IOCON4_CLPOL_POSITION                   0x00000019
#define _IOCON4_CLPOL_MASK                       0x02000000
#define _IOCON4_CLPOL_LENGTH                     0x00000001

#define _IOCON4_CLSRC_POSITION                   0x0000001A
#define _IOCON4_CLSRC_MASK                       0x3C000000
#define _IOCON4_CLSRC_LENGTH                     0x00000004

#define _PDC4_PDC_POSITION                       0x00000000
#define _PDC4_PDC_MASK                           0x0000FFFF
#define _PDC4_PDC_LENGTH                         0x00000010

#define _SDC4_SDC_POSITION                       0x00000000
#define _SDC4_SDC_MASK                           0x0000FFFF
#define _SDC4_SDC_LENGTH                         0x00000010

#define _PHASE4_PHASE_POSITION                   0x00000000
#define _PHASE4_PHASE_MASK                       0x0000FFFF
#define _PHASE4_PHASE_LENGTH                     0x00000010

#define _DTR4_DTR_POSITION                       0x00000000
#define _DTR4_DTR_MASK                           0x0000FFFF
#define _DTR4_DTR_LENGTH                         0x00000010

#define _ALTDTR4_ALTDTR_POSITION                 0x00000000
#define _ALTDTR4_ALTDTR_MASK                     0x0000FFFF
#define _ALTDTR4_ALTDTR_LENGTH                   0x00000010

#define _DTCOMP4_COMP_POSITION                   0x00000000
#define _DTCOMP4_COMP_MASK                       0x00003FFF
#define _DTCOMP4_COMP_LENGTH                     0x0000000E

#define _TRIG4_TRGCMP_POSITION                   0x00000000
#define _TRIG4_TRGCMP_MASK                       0x0000FFFF
#define _TRIG4_TRGCMP_LENGTH                     0x00000010

#define _TRGCON4_STRGIS_POSITION                 0x00000006
#define _TRGCON4_STRGIS_MASK                     0x00000040
#define _TRGCON4_STRGIS_LENGTH                   0x00000001

#define _TRGCON4_DTM_POSITION                    0x00000007
#define _TRGCON4_DTM_MASK                        0x00000080
#define _TRGCON4_DTM_LENGTH                      0x00000001

#define _TRGCON4_STRGSEL_POSITION                0x00000008
#define _TRGCON4_STRGSEL_MASK                    0x00000300
#define _TRGCON4_STRGSEL_LENGTH                  0x00000002

#define _TRGCON4_TRGSEL_POSITION                 0x0000000A
#define _TRGCON4_TRGSEL_MASK                     0x00000C00
#define _TRGCON4_TRGSEL_LENGTH                   0x00000002

#define _TRGCON4_TRGDIV_POSITION                 0x0000000C
#define _TRGCON4_TRGDIV_MASK                     0x0000F000
#define _TRGCON4_TRGDIV_LENGTH                   0x00000004

#define _STRIG4_STRGCMP_POSITION                 0x00000000
#define _STRIG4_STRGCMP_MASK                     0x0000FFFF
#define _STRIG4_STRGCMP_LENGTH                   0x00000010

#define _CAP4_CAP_POSITION                       0x00000000
#define _CAP4_CAP_MASK                           0x0000FFFF
#define _CAP4_CAP_LENGTH                         0x00000010

#define _LEBCON4_CLLEBEN_POSITION                0x0000000A
#define _LEBCON4_CLLEBEN_MASK                    0x00000400
#define _LEBCON4_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON4_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON4_FLTLEBEN_MASK                   0x00000800
#define _LEBCON4_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON4_PLF_POSITION                    0x0000000C
#define _LEBCON4_PLF_MASK                        0x00001000
#define _LEBCON4_PLF_LENGTH                      0x00000001

#define _LEBCON4_PLR_POSITION                    0x0000000D
#define _LEBCON4_PLR_MASK                        0x00002000
#define _LEBCON4_PLR_LENGTH                      0x00000001

#define _LEBCON4_PHF_POSITION                    0x0000000E
#define _LEBCON4_PHF_MASK                        0x00004000
#define _LEBCON4_PHF_LENGTH                      0x00000001

#define _LEBCON4_PHR_POSITION                    0x0000000F
#define _LEBCON4_PHR_MASK                        0x00008000
#define _LEBCON4_PHR_LENGTH                      0x00000001

#define _LEBDLY4_LEB_POSITION                    0x00000000
#define _LEBDLY4_LEB_MASK                        0x00000FFF
#define _LEBDLY4_LEB_LENGTH                      0x0000000C

#define _AUXCON4_CHOPLEN_POSITION                0x00000000
#define _AUXCON4_CHOPLEN_MASK                    0x00000001
#define _AUXCON4_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON4_CHOPHEN_POSITION                0x00000001
#define _AUXCON4_CHOPHEN_MASK                    0x00000002
#define _AUXCON4_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON4_CHOPSEL_POSITION                0x00000002
#define _AUXCON4_CHOPSEL_MASK                    0x0000003C
#define _AUXCON4_CHOPSEL_LENGTH                  0x00000004

#define _PTMR4_TMR_POSITION                      0x00000000
#define _PTMR4_TMR_MASK                          0x0000FFFF
#define _PTMR4_TMR_LENGTH                        0x00000010

#define _QEI1CON_CCM_POSITION                    0x00000000
#define _QEI1CON_CCM_MASK                        0x00000003
#define _QEI1CON_CCM_LENGTH                      0x00000002

#define _QEI1CON_GATEN_POSITION                  0x00000002
#define _QEI1CON_GATEN_MASK                      0x00000004
#define _QEI1CON_GATEN_LENGTH                    0x00000001

