Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
#define _CNPDA_w_POSITION                        0x00000000
#define _CNPDA_w_MASK                            0xFFFFFFFF
#define _CNPDA_w_LENGTH                          0x00000020

#define _CNCONA_EDGEDETECT_POSITION              0x0000000B
#define _CNCONA_EDGEDETECT_MASK                  0x00000800
#define _CNCONA_EDGEDETECT_LENGTH                0x00000001

#define _CNCONA_ON_POSITION                      0x0000000F
#define _CNCONA_ON_MASK                          0x00008000
#define _CNCONA_ON_LENGTH                        0x00000001

#define _CNCONA_w_POSITION                       0x00000000
#define _CNCONA_w_MASK                           0xFFFFFFFF
#define _CNCONA_w_LENGTH                         0x00000020

#define _CNENA_CNIEA0_POSITION                   0x00000000
#define _CNENA_CNIEA0_MASK                       0x00000001
#define _CNENA_CNIEA0_LENGTH                     0x00000001

#define _CNENA_CNIEA1_POSITION                   0x00000001
#define _CNENA_CNIEA1_MASK                       0x00000002
#define _CNENA_CNIEA1_LENGTH                     0x00000001

#define _CNENA_CNIEA4_POSITION                   0x00000004
#define _CNENA_CNIEA4_MASK                       0x00000010
#define _CNENA_CNIEA4_LENGTH                     0x00000001

#define _CNENA_CNIEA7_POSITION                   0x00000007
#define _CNENA_CNIEA7_MASK                       0x00000080
#define _CNENA_CNIEA7_LENGTH                     0x00000001

#define _CNENA_CNIEA8_POSITION                   0x00000008
#define _CNENA_CNIEA8_MASK                       0x00000100
#define _CNENA_CNIEA8_LENGTH                     0x00000001

#define _CNENA_CNIEA10_POSITION                  0x0000000A
#define _CNENA_CNIEA10_MASK                      0x00000400
#define _CNENA_CNIEA10_LENGTH                    0x00000001

#define _CNENA_w_POSITION                        0x00000000
#define _CNENA_w_MASK                            0xFFFFFFFF
#define _CNENA_w_LENGTH                          0x00000020

#define _CNSTATA_CNSTATA0_POSITION               0x00000000
#define _CNSTATA_CNSTATA0_MASK                   0x00000001
#define _CNSTATA_CNSTATA0_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA1_POSITION               0x00000001
#define _CNSTATA_CNSTATA1_MASK                   0x00000002
#define _CNSTATA_CNSTATA1_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA4_POSITION               0x00000004
#define _CNSTATA_CNSTATA4_MASK                   0x00000010
#define _CNSTATA_CNSTATA4_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA7_POSITION               0x00000007
#define _CNSTATA_CNSTATA7_MASK                   0x00000080
#define _CNSTATA_CNSTATA7_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA8_POSITION               0x00000008
#define _CNSTATA_CNSTATA8_MASK                   0x00000100
#define _CNSTATA_CNSTATA8_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA10_POSITION              0x0000000A
#define _CNSTATA_CNSTATA10_MASK                  0x00000400
#define _CNSTATA_CNSTATA10_LENGTH                0x00000001

#define _CNSTATA_w_POSITION                      0x00000000
#define _CNSTATA_w_MASK                          0xFFFFFFFF
#define _CNSTATA_w_LENGTH                        0x00000020

#define _CNNEA_CNNEA0_POSITION                   0x00000000
#define _CNNEA_CNNEA0_MASK                       0x00000001
#define _CNNEA_CNNEA0_LENGTH                     0x00000001

#define _CNNEA_CNNEA1_POSITION                   0x00000001
#define _CNNEA_CNNEA1_MASK                       0x00000002
#define _CNNEA_CNNEA1_LENGTH                     0x00000001

#define _CNNEA_CNNEA4_POSITION                   0x00000004
#define _CNNEA_CNNEA4_MASK                       0x00000010
#define _CNNEA_CNNEA4_LENGTH                     0x00000001

#define _CNNEA_CNNEA7_POSITION                   0x00000007
#define _CNNEA_CNNEA7_MASK                       0x00000080
#define _CNNEA_CNNEA7_LENGTH                     0x00000001

#define _CNNEA_CNNEA8_POSITION                   0x00000008
#define _CNNEA_CNNEA8_MASK                       0x00000100
#define _CNNEA_CNNEA8_LENGTH                     0x00000001

#define _CNNEA_CNNEA10_POSITION                  0x0000000A
#define _CNNEA_CNNEA10_MASK                      0x00000400
#define _CNNEA_CNNEA10_LENGTH                    0x00000001

#define _CNFA_CNFA0_POSITION                     0x00000000
#define _CNFA_CNFA0_MASK                         0x00000001
#define _CNFA_CNFA0_LENGTH                       0x00000001

#define _CNFA_CNFA1_POSITION                     0x00000001
#define _CNFA_CNFA1_MASK                         0x00000002
#define _CNFA_CNFA1_LENGTH                       0x00000001

#define _CNFA_CNFA4_POSITION                     0x00000004
#define _CNFA_CNFA4_MASK                         0x00000010
#define _CNFA_CNFA4_LENGTH                       0x00000001

#define _CNFA_CNFA7_POSITION                     0x00000007
#define _CNFA_CNFA7_MASK                         0x00000080
#define _CNFA_CNFA7_LENGTH                       0x00000001

#define _CNFA_CNFA8_POSITION                     0x00000008
#define _CNFA_CNFA8_MASK                         0x00000100
#define _CNFA_CNFA8_LENGTH                       0x00000001

#define _CNFA_CNFA10_POSITION                    0x0000000A
#define _CNFA_CNFA10_MASK                        0x00000400
#define _CNFA_CNFA10_LENGTH                      0x00000001

#define _SRCON0A_SR0A7_POSITION                  0x00000007
#define _SRCON0A_SR0A7_MASK                      0x00000080
#define _SRCON0A_SR0A7_LENGTH                    0x00000001

#define _SRCON0A_SR0A8_POSITION                  0x00000008
#define _SRCON0A_SR0A8_MASK                      0x00000100
#define _SRCON0A_SR0A8_LENGTH                    0x00000001

#define _SRCON0A_SR0A10_POSITION                 0x0000000A
#define _SRCON0A_SR0A10_MASK                     0x00000400
#define _SRCON0A_SR0A10_LENGTH                   0x00000001

#define _SRCON1A_SR1A7_POSITION                  0x00000007
#define _SRCON1A_SR1A7_MASK                      0x00000080
#define _SRCON1A_SR1A7_LENGTH                    0x00000001

#define _SRCON1A_SR1A8_POSITION                  0x00000008
#define _SRCON1A_SR1A8_MASK                      0x00000100
#define _SRCON1A_SR1A8_LENGTH                    0x00000001

