Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
#define _ADCTRGMODE_STRGEN1_POSITION             0x00000009
#define _ADCTRGMODE_STRGEN1_MASK                 0x00000200
#define _ADCTRGMODE_STRGEN1_LENGTH               0x00000001

#define _ADCTRGMODE_SH0ALT_POSITION              0x00000010
#define _ADCTRGMODE_SH0ALT_MASK                  0x00030000
#define _ADCTRGMODE_SH0ALT_LENGTH                0x00000002

#define _ADCTRGMODE_SH1ALT_POSITION              0x00000012
#define _ADCTRGMODE_SH1ALT_MASK                  0x000C0000
#define _ADCTRGMODE_SH1ALT_LENGTH                0x00000002

#define _ADCIMCON1_SIGN0_POSITION                0x00000000
#define _ADCIMCON1_SIGN0_MASK                    0x00000001
#define _ADCIMCON1_SIGN0_LENGTH                  0x00000001

#define _ADCIMCON1_DIFF0_POSITION                0x00000001
#define _ADCIMCON1_DIFF0_MASK                    0x00000002
#define _ADCIMCON1_DIFF0_LENGTH                  0x00000001

#define _ADCIMCON1_SIGN1_POSITION                0x00000002
#define _ADCIMCON1_SIGN1_MASK                    0x00000004
#define _ADCIMCON1_SIGN1_LENGTH                  0x00000001

#define _ADCIMCON1_DIFF1_POSITION                0x00000003
#define _ADCIMCON1_DIFF1_MASK                    0x00000008
#define _ADCIMCON1_DIFF1_LENGTH                  0x00000001

#define _ADCIMCON1_SIGN2_POSITION                0x00000004
#define _ADCIMCON1_SIGN2_MASK                    0x00000010
#define _ADCIMCON1_SIGN2_LENGTH                  0x00000001

#define _ADCIMCON1_DIFF2_POSITION                0x00000005
#define _ADCIMCON1_DIFF2_MASK                    0x00000020
#define _ADCIMCON1_DIFF2_LENGTH                  0x00000001

#define _ADCIMCON1_SIGN3_POSITION                0x00000006
#define _ADCIMCON1_SIGN3_MASK                    0x00000040
#define _ADCIMCON1_SIGN3_LENGTH                  0x00000001

#define _ADCIMCON1_DIFF3_POSITION                0x00000007
#define _ADCIMCON1_DIFF3_MASK                    0x00000080
#define _ADCIMCON1_DIFF3_LENGTH                  0x00000001

#define _ADCIMCON1_SIGN4_POSITION                0x00000008
#define _ADCIMCON1_SIGN4_MASK                    0x00000100
#define _ADCIMCON1_SIGN4_LENGTH                  0x00000001

#define _ADCIMCON1_DIFF4_POSITION                0x00000009
#define _ADCIMCON1_DIFF4_MASK                    0x00000200
#define _ADCIMCON1_DIFF4_LENGTH                  0x00000001

#define _ADCIMCON1_SIGN5_POSITION                0x0000000A
#define _ADCIMCON1_SIGN5_MASK                    0x00000400
#define _ADCIMCON1_SIGN5_LENGTH                  0x00000001

#define _ADCIMCON1_DIFF5_POSITION                0x0000000B
#define _ADCIMCON1_DIFF5_MASK                    0x00000800
#define _ADCIMCON1_DIFF5_LENGTH                  0x00000001

#define _ADCIMCON1_SIGN9_POSITION                0x00000012
#define _ADCIMCON1_SIGN9_MASK                    0x00040000
#define _ADCIMCON1_SIGN9_LENGTH                  0x00000001

#define _ADCIMCON1_DIFF9_POSITION                0x00000013
#define _ADCIMCON1_DIFF9_MASK                    0x00080000
#define _ADCIMCON1_DIFF9_LENGTH                  0x00000001

#define _ADCIMCON1_SIGN12_POSITION               0x00000018
#define _ADCIMCON1_SIGN12_MASK                   0x01000000
#define _ADCIMCON1_SIGN12_LENGTH                 0x00000001

#define _ADCIMCON1_DIFF12_POSITION               0x00000019
#define _ADCIMCON1_DIFF12_MASK                   0x02000000
#define _ADCIMCON1_DIFF12_LENGTH                 0x00000001

#define _ADCIMCON1_SIGN13_POSITION               0x0000001A
#define _ADCIMCON1_SIGN13_MASK                   0x04000000
#define _ADCIMCON1_SIGN13_LENGTH                 0x00000001

#define _ADCIMCON1_DIFF13_POSITION               0x0000001B
#define _ADCIMCON1_DIFF13_MASK                   0x08000000
#define _ADCIMCON1_DIFF13_LENGTH                 0x00000001

#define _ADCIMCON1_SIGN15_POSITION               0x0000001E
#define _ADCIMCON1_SIGN15_MASK                   0x40000000
#define _ADCIMCON1_SIGN15_LENGTH                 0x00000001

#define _ADCIMCON1_DIFF15_POSITION               0x0000001F
#define _ADCIMCON1_DIFF15_MASK                   0x80000000
#define _ADCIMCON1_DIFF15_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN16_POSITION               0x00000000
#define _ADCIMCON2_SIGN16_MASK                   0x00000001
#define _ADCIMCON2_SIGN16_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF16_POSITION               0x00000001
#define _ADCIMCON2_DIFF16_MASK                   0x00000002
#define _ADCIMCON2_DIFF16_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN17_POSITION               0x00000002
#define _ADCIMCON2_SIGN17_MASK                   0x00000004
#define _ADCIMCON2_SIGN17_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF17_POSITION               0x00000003
#define _ADCIMCON2_DIFF17_MASK                   0x00000008
#define _ADCIMCON2_DIFF17_LENGTH                 0x00000001

#define _ADCGIRQEN1_AGIEN0_POSITION              0x00000000
#define _ADCGIRQEN1_AGIEN0_MASK                  0x00000001
#define _ADCGIRQEN1_AGIEN0_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN1_POSITION              0x00000001
#define _ADCGIRQEN1_AGIEN1_MASK                  0x00000002
#define _ADCGIRQEN1_AGIEN1_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN2_POSITION              0x00000002
#define _ADCGIRQEN1_AGIEN2_MASK                  0x00000004
#define _ADCGIRQEN1_AGIEN2_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN3_POSITION              0x00000003
#define _ADCGIRQEN1_AGIEN3_MASK                  0x00000008
#define _ADCGIRQEN1_AGIEN3_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN4_POSITION              0x00000004
#define _ADCGIRQEN1_AGIEN4_MASK                  0x00000010
#define _ADCGIRQEN1_AGIEN4_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN5_POSITION              0x00000005
#define _ADCGIRQEN1_AGIEN5_MASK                  0x00000020
#define _ADCGIRQEN1_AGIEN5_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN9_POSITION              0x00000009
#define _ADCGIRQEN1_AGIEN9_MASK                  0x00000200
#define _ADCGIRQEN1_AGIEN9_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN12_POSITION             0x0000000C
#define _ADCGIRQEN1_AGIEN12_MASK                 0x00001000
#define _ADCGIRQEN1_AGIEN12_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN13_POSITION             0x0000000D
#define _ADCGIRQEN1_AGIEN13_MASK                 0x00002000
#define _ADCGIRQEN1_AGIEN13_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN15_POSITION             0x0000000F
#define _ADCGIRQEN1_AGIEN15_MASK                 0x00008000
#define _ADCGIRQEN1_AGIEN15_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN16_POSITION             0x00000010
#define _ADCGIRQEN1_AGIEN16_MASK                 0x00010000
#define _ADCGIRQEN1_AGIEN16_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN17_POSITION             0x00000011
#define _ADCGIRQEN1_AGIEN17_MASK                 0x00020000
#define _ADCGIRQEN1_AGIEN17_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN50_POSITION             0x00000012
#define _ADCGIRQEN2_AGIEN50_MASK                 0x00040000
#define _ADCGIRQEN2_AGIEN50_LENGTH               0x00000001

