Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
#define _ADCGIRQEN2_AGIEN53_POSITION             0x00000015
#define _ADCGIRQEN2_AGIEN53_MASK                 0x00200000
#define _ADCGIRQEN2_AGIEN53_LENGTH               0x00000001

#define _ADCCSS1_CSS0_POSITION                   0x00000000
#define _ADCCSS1_CSS0_MASK                       0x00000001
#define _ADCCSS1_CSS0_LENGTH                     0x00000001

#define _ADCCSS1_CSS1_POSITION                   0x00000001
#define _ADCCSS1_CSS1_MASK                       0x00000002
#define _ADCCSS1_CSS1_LENGTH                     0x00000001

#define _ADCCSS1_CSS2_POSITION                   0x00000002
#define _ADCCSS1_CSS2_MASK                       0x00000004
#define _ADCCSS1_CSS2_LENGTH                     0x00000001

#define _ADCCSS1_CSS3_POSITION                   0x00000003
#define _ADCCSS1_CSS3_MASK                       0x00000008
#define _ADCCSS1_CSS3_LENGTH                     0x00000001

#define _ADCCSS1_CSS4_POSITION                   0x00000004
#define _ADCCSS1_CSS4_MASK                       0x00000010
#define _ADCCSS1_CSS4_LENGTH                     0x00000001

#define _ADCCSS1_CSS5_POSITION                   0x00000005
#define _ADCCSS1_CSS5_MASK                       0x00000020
#define _ADCCSS1_CSS5_LENGTH                     0x00000001

#define _ADCCSS1_CSS9_POSITION                   0x00000009
#define _ADCCSS1_CSS9_MASK                       0x00000200
#define _ADCCSS1_CSS9_LENGTH                     0x00000001

#define _ADCCSS1_CSS12_POSITION                  0x0000000C
#define _ADCCSS1_CSS12_MASK                      0x00001000
#define _ADCCSS1_CSS12_LENGTH                    0x00000001

#define _ADCCSS1_CSS13_POSITION                  0x0000000D
#define _ADCCSS1_CSS13_MASK                      0x00002000
#define _ADCCSS1_CSS13_LENGTH                    0x00000001

#define _ADCCSS1_CSS15_POSITION                  0x0000000F
#define _ADCCSS1_CSS15_MASK                      0x00008000
#define _ADCCSS1_CSS15_LENGTH                    0x00000001

#define _ADCCSS1_CSS16_POSITION                  0x00000010
#define _ADCCSS1_CSS16_MASK                      0x00010000
#define _ADCCSS1_CSS16_LENGTH                    0x00000001

#define _ADCCSS1_CSS17_POSITION                  0x00000011
#define _ADCCSS1_CSS17_MASK                      0x00020000
#define _ADCCSS1_CSS17_LENGTH                    0x00000001

#define _ADCCSS2_CSS50_POSITION                  0x00000012
#define _ADCCSS2_CSS50_MASK                      0x00040000
#define _ADCCSS2_CSS50_LENGTH                    0x00000001

#define _ADCCSS2_CSS53_POSITION                  0x00000015
#define _ADCCSS2_CSS53_MASK                      0x00200000
#define _ADCCSS2_CSS53_LENGTH                    0x00000001

#define _ADCDSTAT1_ARDY0_POSITION                0x00000000
#define _ADCDSTAT1_ARDY0_MASK                    0x00000001
#define _ADCDSTAT1_ARDY0_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY1_POSITION                0x00000001
#define _ADCDSTAT1_ARDY1_MASK                    0x00000002
#define _ADCDSTAT1_ARDY1_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY2_POSITION                0x00000002
#define _ADCDSTAT1_ARDY2_MASK                    0x00000004
#define _ADCDSTAT1_ARDY2_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY3_POSITION                0x00000003
#define _ADCDSTAT1_ARDY3_MASK                    0x00000008
#define _ADCDSTAT1_ARDY3_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY4_POSITION                0x00000004
#define _ADCDSTAT1_ARDY4_MASK                    0x00000010
#define _ADCDSTAT1_ARDY4_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY5_POSITION                0x00000005
#define _ADCDSTAT1_ARDY5_MASK                    0x00000020
#define _ADCDSTAT1_ARDY5_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY9_POSITION                0x00000009
#define _ADCDSTAT1_ARDY9_MASK                    0x00000200
#define _ADCDSTAT1_ARDY9_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY12_POSITION               0x0000000C
#define _ADCDSTAT1_ARDY12_MASK                   0x00001000
#define _ADCDSTAT1_ARDY12_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY13_POSITION               0x0000000D
#define _ADCDSTAT1_ARDY13_MASK                   0x00002000
#define _ADCDSTAT1_ARDY13_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY15_POSITION               0x0000000F
#define _ADCDSTAT1_ARDY15_MASK                   0x00008000
#define _ADCDSTAT1_ARDY15_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY16_POSITION               0x00000010
#define _ADCDSTAT1_ARDY16_MASK                   0x00010000
#define _ADCDSTAT1_ARDY16_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY17_POSITION               0x00000011
#define _ADCDSTAT1_ARDY17_MASK                   0x00020000
#define _ADCDSTAT1_ARDY17_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY50_POSITION               0x00000012
#define _ADCDSTAT2_ARDY50_MASK                   0x00040000
#define _ADCDSTAT2_ARDY50_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY53_POSITION               0x00000015
#define _ADCDSTAT2_ARDY53_MASK                   0x00200000
#define _ADCDSTAT2_ARDY53_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE0_POSITION                0x00000000
#define _ADCCMPEN1_CMPE0_MASK                    0x00000001
#define _ADCCMPEN1_CMPE0_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE1_POSITION                0x00000001
#define _ADCCMPEN1_CMPE1_MASK                    0x00000002
#define _ADCCMPEN1_CMPE1_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE2_POSITION                0x00000002
#define _ADCCMPEN1_CMPE2_MASK                    0x00000004
#define _ADCCMPEN1_CMPE2_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE3_POSITION                0x00000003
#define _ADCCMPEN1_CMPE3_MASK                    0x00000008
#define _ADCCMPEN1_CMPE3_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE4_POSITION                0x00000004
#define _ADCCMPEN1_CMPE4_MASK                    0x00000010
#define _ADCCMPEN1_CMPE4_LENGTH                  0x00000001

