Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
#define _ADCFLTR2_DFMODE_POSITION                0x0000001D
#define _ADCFLTR2_DFMODE_MASK                    0x20000000
#define _ADCFLTR2_DFMODE_LENGTH                  0x00000001

#define _ADCFLTR2_DATA16EN_POSITION              0x0000001E
#define _ADCFLTR2_DATA16EN_MASK                  0x40000000
#define _ADCFLTR2_DATA16EN_LENGTH                0x00000001

#define _ADCFLTR2_AFEN_POSITION                  0x0000001F
#define _ADCFLTR2_AFEN_MASK                      0x80000000
#define _ADCFLTR2_AFEN_LENGTH                    0x00000001

#define _ADCTRG1_TRGSRC0_POSITION                0x00000000
#define _ADCTRG1_TRGSRC0_MASK                    0x0000001F
#define _ADCTRG1_TRGSRC0_LENGTH                  0x00000005

#define _ADCTRG1_TRGSRC1_POSITION                0x00000008
#define _ADCTRG1_TRGSRC1_MASK                    0x00001F00
#define _ADCTRG1_TRGSRC1_LENGTH                  0x00000005

#define _ADCTRG1_TRGSRC2_POSITION                0x00000010
#define _ADCTRG1_TRGSRC2_MASK                    0x001F0000
#define _ADCTRG1_TRGSRC2_LENGTH                  0x00000005

#define _ADCTRG1_TRGSRC3_POSITION                0x00000018
#define _ADCTRG1_TRGSRC3_MASK                    0x1F000000
#define _ADCTRG1_TRGSRC3_LENGTH                  0x00000005

#define _ADCTRG2_TRGSRC4_POSITION                0x00000000
#define _ADCTRG2_TRGSRC4_MASK                    0x0000001F
#define _ADCTRG2_TRGSRC4_LENGTH                  0x00000005

#define _ADCTRG2_TRGSRC5_POSITION                0x00000008
#define _ADCTRG2_TRGSRC5_MASK                    0x00001F00
#define _ADCTRG2_TRGSRC5_LENGTH                  0x00000005

#define _ADCTRG3_TRGSRC9_POSITION                0x00000008
#define _ADCTRG3_TRGSRC9_MASK                    0x00001F00
#define _ADCTRG3_TRGSRC9_LENGTH                  0x00000005

#define _ADCTRG4_TRGSRC12_POSITION               0x00000000
#define _ADCTRG4_TRGSRC12_MASK                   0x0000001F
#define _ADCTRG4_TRGSRC12_LENGTH                 0x00000005

#define _ADCTRG4_TRGSRC13_POSITION               0x00000008
#define _ADCTRG4_TRGSRC13_MASK                   0x00001F00
#define _ADCTRG4_TRGSRC13_LENGTH                 0x00000005

#define _ADCTRG4_TRGSRC15_POSITION               0x00000018
#define _ADCTRG4_TRGSRC15_MASK                   0x1F000000
#define _ADCTRG4_TRGSRC15_LENGTH                 0x00000005

#define _ADCTRG5_TRGSRC16_POSITION               0x00000000
#define _ADCTRG5_TRGSRC16_MASK                   0x0000001F
#define _ADCTRG5_TRGSRC16_LENGTH                 0x00000005

#define _ADCTRG5_TRGSRC17_POSITION               0x00000008
#define _ADCTRG5_TRGSRC17_MASK                   0x00001F00
#define _ADCTRG5_TRGSRC17_LENGTH                 0x00000005

#define _ADCCMPCON1_IELOLO_POSITION              0x00000000
#define _ADCCMPCON1_IELOLO_MASK                  0x00000001
#define _ADCCMPCON1_IELOLO_LENGTH                0x00000001

#define _ADCCMPCON1_IELOHI_POSITION              0x00000001
#define _ADCCMPCON1_IELOHI_MASK                  0x00000002
#define _ADCCMPCON1_IELOHI_LENGTH                0x00000001

#define _ADCCMPCON1_IEHILO_POSITION              0x00000002
#define _ADCCMPCON1_IEHILO_MASK                  0x00000004
#define _ADCCMPCON1_IEHILO_LENGTH                0x00000001

#define _ADCCMPCON1_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON1_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON1_IEHIHI_LENGTH                0x00000001

#define _ADCCMPCON1_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON1_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON1_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON1_DCMPED_POSITION              0x00000005
#define _ADCCMPCON1_DCMPED_MASK                  0x00000020
#define _ADCCMPCON1_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON1_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON1_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON1_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON1_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON1_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON1_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON1_AINID_POSITION               0x00000008
#define _ADCCMPCON1_AINID_MASK                   0x00003F00
#define _ADCCMPCON1_AINID_LENGTH                 0x00000006

#define _ADCCMPCON2_IELOLO_POSITION              0x00000000
#define _ADCCMPCON2_IELOLO_MASK                  0x00000001
#define _ADCCMPCON2_IELOLO_LENGTH                0x00000001

#define _ADCCMPCON2_IELOHI_POSITION              0x00000001
#define _ADCCMPCON2_IELOHI_MASK                  0x00000002
#define _ADCCMPCON2_IELOHI_LENGTH                0x00000001

#define _ADCCMPCON2_IEHILO_POSITION              0x00000002
#define _ADCCMPCON2_IEHILO_MASK                  0x00000004
#define _ADCCMPCON2_IEHILO_LENGTH                0x00000001

#define _ADCCMPCON2_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON2_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON2_IEHIHI_LENGTH                0x00000001

#define _ADCCMPCON2_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON2_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON2_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON2_DCMPED_POSITION              0x00000005
#define _ADCCMPCON2_DCMPED_MASK                  0x00000020
#define _ADCCMPCON2_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON2_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON2_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON2_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON2_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON2_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON2_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON2_AINID_POSITION               0x00000008
#define _ADCCMPCON2_AINID_MASK                   0x00001F00
#define _ADCCMPCON2_AINID_LENGTH                 0x00000005

#define _ADCBASE_ADCBASE_POSITION                0x00000000
#define _ADCBASE_ADCBASE_MASK                    0x0000FFFF
#define _ADCBASE_ADCBASE_LENGTH                  0x00000010

#define _ADCDSTAT_RAF0_POSITION                  0x00000000
#define _ADCDSTAT_RAF0_MASK                      0x00000001
#define _ADCDSTAT_RAF0_LENGTH                    0x00000001

#define _ADCDSTAT_RAF1_POSITION                  0x00000001
#define _ADCDSTAT_RAF1_MASK                      0x00000002
#define _ADCDSTAT_RAF1_LENGTH                    0x00000001

#define _ADCDSTAT_RAFIEN0_POSITION               0x00000008
#define _ADCDSTAT_RAFIEN0_MASK                   0x00000100
#define _ADCDSTAT_RAFIEN0_LENGTH                 0x00000001

#define _ADCDSTAT_RAFIEN1_POSITION               0x00000009
#define _ADCDSTAT_RAFIEN1_MASK                   0x00000200
#define _ADCDSTAT_RAFIEN1_LENGTH                 0x00000001

#define _ADCDSTAT_DMACEN_POSITION                0x0000000F
#define _ADCDSTAT_DMACEN_MASK                    0x00008000
#define _ADCDSTAT_DMACEN_LENGTH                  0x00000001

