Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca032.h
/* Base Addresses for Peripherals */
#define _ADCHS_BASE_ADDRESS                      0xBF887000
#define _CDAC1_BASE_ADDRESS                      0xBF82C600
#define _CFG_BASE_ADDRESS                        0xBF800000
#define _CLC1_BASE_ADDRESS                       0xBF82D200
#define _CMP1_BASE_ADDRESS                       0xBF82C010
#define _CMP2_BASE_ADDRESS                       0xBF82C030
#define _CMP3_BASE_ADDRESS                       0xBF82C050
#define _CMP4_BASE_ADDRESS                       0xBF82C070
#define _CMP5_BASE_ADDRESS                       0xBF82C090
#define _CRU_BASE_ADDRESS                        0xBF801200
#define _CTMU_BASE_ADDRESS                       0xBF82D000
#define _DMAC_BASE_ADDRESS                       0xBF811000
#define _DMT_BASE_ADDRESS                        0xBF800E00
#define _HLVD_BASE_ADDRESS                       0xBF801800
#define _I2C1_BASE_ADDRESS                       0xBF826000
#define _I2C2_BASE_ADDRESS                       0xBF826200
#define _ICAP1_BASE_ADDRESS                      0xBF822000
#define _ICAP2_BASE_ADDRESS                      0xBF822200
#define _ICAP3_BASE_ADDRESS                      0xBF822400
#define _ICAP4_BASE_ADDRESS                      0xBF822600
#define _INT_BASE_ADDRESS                        0xBF810000
#define _MCPWMCHANNEL_BASE_ADDRESS               0xBF82A0C0
#define _MCPWMMODULE_BASE_ADDRESS                0xBF82A000
#define _NVM_BASE_ADDRESS                        0xBF800A00
#define _OCMP1_BASE_ADDRESS                      0xBF824000
#define _OCMP2_BASE_ADDRESS                      0xBF824200
#define _OCMP3_BASE_ADDRESS                      0xBF824400
#define _OCMP4_BASE_ADDRESS                      0xBF824600
#define _PCACHE_BASE_ADDRESS                     0xBF800800
#define _PORTA_BASE_ADDRESS                      0xBF860020
#define _PORTB_BASE_ADDRESS                      0xBF860120
#define _PORTC_BASE_ADDRESS                      0xBF860220
#define _PORTD_BASE_ADDRESS                      0xBF860320
#define _RTCC_BASE_ADDRESS                       0xBF8C0000
#define _SB_BASE_ADDRESS                         0xBF8F0510
#define _SPI1_BASE_ADDRESS                       0xBF827000
#define _SPI2_BASE_ADDRESS                       0xBF827200
#define _TMR1_BASE_ADDRESS                       0xBF820000
#define _TMR2_BASE_ADDRESS                       0xBF820200
#define _TMR3_BASE_ADDRESS                       0xBF820400
#define _TMR4_BASE_ADDRESS                       0xBF820600
#define _TMR5_BASE_ADDRESS                       0xBF820800
#define _UART1_BASE_ADDRESS                      0xBF828000
#define _UART2_BASE_ADDRESS                      0xBF828200
#define _UARTAB_BASE_ADDRESS                     0xBF828000
#define _UARTCD_BASE_ADDRESS                     0xBF828200
#define _WDT_BASE_ADDRESS                        0xBF800C00
#define __DDPSTAT_BASE_ADDRESS                   0xBF801010

/* Default Memory-region macros */
#define __KSEG1_BOOT_MEM_BASE                    0xBFC00000
#define __KSEG1_BOOT_MEM_LENGTH                  0x480
#define __KSEG1_BOOT_MEM_4B0_BASE                0xBFC004B0
#define __KSEG1_BOOT_MEM_4B0_LENGTH              0x3A80
#define __BOOT1LASTPAGE_BASE                     0xBFC44000
#define __BOOT1LASTPAGE_LENGTH                   0x1000
#define __BOOT1_BASE                             0xBFC40000
#define __BOOT1_LENGTH                           0x3F30
#define __LOWERBOOTALIASLASTPAGE_BASE            0xBFC04000
#define __LOWERBOOTALIASLASTPAGE_LENGTH          0x1000
#define __DEBUG_EXEC_MEM_BASE                    0x9FC04490
#define __DEBUG_EXEC_MEM_LENGTH                  0xB70
#define __KSEG0_PROGRAM_MEM_BASE                 0x9D000000
#define __KSEG0_PROGRAM_MEM_LENGTH               0x20000
#define __KSEG0_DATA_MEM_BASE                    0x80000000
#define __KSEG0_DATA_MEM_LENGTH                  0x8000
#define __CONFIGSFRS_BFC03FB0_BASE               0xBFC03FB0
#define __CONFIGSFRS_BFC03FB0_LENGTH             0x1C
#define __CONFIGSFRS_BFC45020_BASE               0xBFC45020
#define __CONFIGSFRS_BFC45020_LENGTH             0x10
#define __CONFIGSFRS_BFC43FB0_BASE               0xBFC43FB0
#define __CONFIGSFRS_BFC43FB0_LENGTH             0x1C
#define __CONFIGSFRS_BFC43F30_BASE               0xBFC43F30
#define __CONFIGSFRS_BFC43F30_LENGTH             0x1C
#define __CONFIGSFRS_BFC03F30_BASE               0xBFC03F30
#define __CONFIGSFRS_BFC03F30_LENGTH             0x1C
#define __CONFIGSFRS_BFC45000_BASE               0xBFC45000
#define __CONFIGSFRS_BFC45000_LENGTH             0xC
#define __SFRS_BASE                              0xBF800000
#define __SFRS_LENGTH                            0x100000

/*  The following device macros are predefined by the MPLAB XC32
 *  compiler when compiling with the -mprocessor=<device> option.
 *  We also define them here to help the MPLAB X editor evaluate
 *  them correctly.
 */
#ifndef __32MK0128MCA032
#  define __32MK0128MCA032 1
#endif
#ifndef __32MK0128MCA032__
#  define __32MK0128MCA032__ 1
#endif
#ifndef __XC__
#  define __XC__ 1
#endif
#ifndef __XC
#  define __XC 1
#endif
#ifndef __XC32__
#  define __XC32__ 1
#endif
#ifndef __XC32
#  define __XC32 1
#endif
#ifndef __PIC32_FLASH_SIZE
#  define __PIC32_FLASH_SIZE 128
#endif
#ifndef __PIC32MK
#  define __PIC32MK 1
#endif
#ifndef __PIC32MK__
#  define __PIC32MK__ 1
#endif
/*  The following device macros indicate which core features are
 *  available on this device.
 */
#ifndef __PIC32_HAS_MIPS32R2
# define __PIC32_HAS_MIPS32R2 1
#endif
#ifndef __PIC32_HAS_MICROMIPS
# define __PIC32_HAS_MICROMIPS 1
#endif
#ifndef __PIC32_HAS_DSPR2
# define __PIC32_HAS_DSPR2 1
#endif
#ifndef __PIC32_HAS_FPU64
# define __PIC32_HAS_FPU64 1
#endif
#ifndef __PIC32_HAS_SSX
# define __PIC32_HAS_SSX 1
#endif
#ifndef __PIC32_HAS_INIT_DATA
# define __PIC32_HAS_INIT_DATA 1
#endif
#ifndef __PIC32_SRS_SET_COUNT
# define __PIC32_SRS_SET_COUNT 8
#endif

#endif
